bekencorp/bk_idk/middleware/soc/bk723L/soc/sys_reg.h
// Copyright 2022-2023 Beken
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

// This is a generated file, if you need to modify it, use the script to
// generate and modify all the struct.h, ll.h, reg.h, debug_dump.c files!

#pragma once

#include "sdkconfig.h"

#ifdef __cplusplus
extern "C" {
#endif


#define SYS_DEVICE_ID_ADDR (SOC_SYS_REG_BASE + (0x0 << 2))

#define SYS_DEVICE_ID_DEVICEID_POS (0)
#define SYS_DEVICE_ID_DEVICEID_MASK (0xffffffff)

#define SYS_VERSION_ID_ADDR (SOC_SYS_REG_BASE + (0x1 << 2))

#define SYS_VERSION_ID_VERSIONID_POS (0)
#define SYS_VERSION_ID_VERSIONID_MASK (0xffffffff)

#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_ADDR (SOC_SYS_REG_BASE + (0x2 << 2))

#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_BOOT_MODE_POS (0)
#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_BOOT_MODE_MASK (0x1)

#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_RESERVED_BIT_1_6_POS (1)
#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_RESERVED_BIT_1_6_MASK (0x3f)

#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_JTAG_CORE_SEL_POS (7)
#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_JTAG_CORE_SEL_MASK (0x3)

#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_FLASH_SEL_POS (9)
#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_FLASH_SEL_MASK (0x1)

#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_RESERVED_BIT_10_31_POS (10)
#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_RESERVED_BIT_10_31_MASK (0x3fffff)

#define SYS_CPU_CURRENT_RUN_STATUS_ADDR (SOC_SYS_REG_BASE + (0x3 << 2))

#define SYS_CPU_CURRENT_RUN_STATUS_CORE0_HALTED_POS (0)
#define SYS_CPU_CURRENT_RUN_STATUS_CORE0_HALTED_MASK (0x1)

#define SYS_CPU_CURRENT_RUN_STATUS_CORE1_HALTED_POS (1)
#define SYS_CPU_CURRENT_RUN_STATUS_CORE1_HALTED_MASK (0x1)

#define SYS_CPU_CURRENT_RUN_STATUS_CORE2_HALTED_POS (2)
#define SYS_CPU_CURRENT_RUN_STATUS_CORE2_HALTED_MASK (0x1)

#define SYS_CPU_CURRENT_RUN_STATUS_RESERVED_BIT_3_3_POS (3)
#define SYS_CPU_CURRENT_RUN_STATUS_RESERVED_BIT_3_3_MASK (0x1)

#define SYS_CPU_CURRENT_RUN_STATUS_CPU0_SW_RESET_POS (4)
#define SYS_CPU_CURRENT_RUN_STATUS_CPU0_SW_RESET_MASK (0x1)

#define SYS_CPU_CURRENT_RUN_STATUS_CPU1_SW_RESET_POS (5)
#define SYS_CPU_CURRENT_RUN_STATUS_CPU1_SW_RESET_MASK (0x1)

#define SYS_CPU_CURRENT_RUN_STATUS_CPU2_SW_RESET_POS (6)
#define SYS_CPU_CURRENT_RUN_STATUS_CPU2_SW_RESET_MASK (0x1)

#define SYS_CPU_CURRENT_RUN_STATUS_RESERVED_BIT_7_7_POS (7)
#define SYS_CPU_CURRENT_RUN_STATUS_RESERVED_BIT_7_7_MASK (0x1)

#define SYS_CPU_CURRENT_RUN_STATUS_CPU0_PWR_DW_STATE_POS (8)
#define SYS_CPU_CURRENT_RUN_STATUS_CPU0_PWR_DW_STATE_MASK (0x1)

#define SYS_CPU_CURRENT_RUN_STATUS_CPU1_PWR_DW_STATE_POS (9)
#define SYS_CPU_CURRENT_RUN_STATUS_CPU1_PWR_DW_STATE_MASK (0x1)

#define SYS_CPU_CURRENT_RUN_STATUS_CPU2_PWR_DW_STATE_POS (10)
#define SYS_CPU_CURRENT_RUN_STATUS_CPU2_PWR_DW_STATE_MASK (0x1)

#define SYS_CPU_CURRENT_RUN_STATUS_RESERVED_BIT_11_31_POS (11)
#define SYS_CPU_CURRENT_RUN_STATUS_RESERVED_BIT_11_31_MASK (0x1fffff)

#define SYS_CPU0_INT_HALT_CLK_OP_ADDR (SOC_SYS_REG_BASE + (0x4 << 2))

#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_SW_RST_POS (0)
#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_SW_RST_MASK (0x1)

#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_PWR_DW_POS (1)
#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_PWR_DW_MASK (0x1)

#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_INT_MASK_POS (2)
#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_INT_MASK_MASK (0x1)

#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_HALT_POS (3)
#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_HALT_MASK (0x1)

#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_SPEED_POS (4)
#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_SPEED_MASK (0x1)

#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_RXEVT_SEL_POS (5)
#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_RXEVT_SEL_MASK (0x1)

#define SYS_CPU0_INT_HALT_CLK_OP_RESERVED_6_7_POS (6)
#define SYS_CPU0_INT_HALT_CLK_OP_RESERVED_6_7_MASK (0x3)

#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_OFFSET_POS (8)
#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_OFFSET_MASK (0xffffff)

#define SYS_CPU1_INT_HALT_CLK_OP_ADDR (SOC_SYS_REG_BASE + (0x5 << 2))

#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_SW_RST_POS (0)
#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_SW_RST_MASK (0x1)

#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_PWR_DW_POS (1)
#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_PWR_DW_MASK (0x1)

#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_INT_MASK_POS (2)
#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_INT_MASK_MASK (0x1)

#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_HALT_POS (3)
#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_HALT_MASK (0x1)

#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_SPEED_POS (4)
#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_SPEED_MASK (0x1)

#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_RXEVT_SEL_POS (5)
#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_RXEVT_SEL_MASK (0x1)

#define SYS_CPU1_INT_HALT_CLK_OP_RESERVED_6_7_POS (6)
#define SYS_CPU1_INT_HALT_CLK_OP_RESERVED_6_7_MASK (0x3)

#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_OFFSET_POS (8)
#define SYS_CPU1_INT_HALT_CLK_OP_CPU1_OFFSET_MASK (0xffffff)

#define SYS_CPU2_INT_HALT_CLK_OP_ADDR (SOC_SYS_REG_BASE + (0x6 << 2))

#define SYS_CPU2_INT_HALT_CLK_OP_CPU2_SW_RST_POS (0)
#define SYS_CPU2_INT_HALT_CLK_OP_CPU2_SW_RST_MASK (0x1)

#define SYS_CPU2_INT_HALT_CLK_OP_CPU2_PWR_DW_POS (1)
#define SYS_CPU2_INT_HALT_CLK_OP_CPU2_PWR_DW_MASK (0x1)

#define SYS_CPU2_INT_HALT_CLK_OP_CPU2_INT_MASK_POS (2)
#define SYS_CPU2_INT_HALT_CLK_OP_CPU2_INT_MASK_MASK (0x1)

#define SYS_CPU2_INT_HALT_CLK_OP_CPU2_HALT_POS (3)
#define SYS_CPU2_INT_HALT_CLK_OP_CPU2_HALT_MASK (0x1)

#define SYS_CPU2_INT_HALT_CLK_OP_CPU2_SPEED_POS (4)
#define SYS_CPU2_INT_HALT_CLK_OP_CPU2_SPEED_MASK (0x1)

#define SYS_CPU2_INT_HALT_CLK_OP_CPU2_RXEVT_SEL_POS (5)
#define SYS_CPU2_INT_HALT_CLK_OP_CPU2_RXEVT_SEL_MASK (0x1)

#define SYS_CPU2_INT_HALT_CLK_OP_RESERVED_6_7_POS (6)
#define SYS_CPU2_INT_HALT_CLK_OP_RESERVED_6_7_MASK (0x3)

#define SYS_CPU2_INT_HALT_CLK_OP_CPU2_OFFSET_POS (8)
#define SYS_CPU2_INT_HALT_CLK_OP_CPU2_OFFSET_MASK (0xffffff)

#define SYS_RESERVED_REG0X7_ADDR (SOC_SYS_REG_BASE + (0x7 << 2))

#define SYS_RESERVED_REG0X7_RESERVED_0_31_POS (0)
#define SYS_RESERVED_REG0X7_RESERVED_0_31_MASK (0xffffffff)

#define SYS_CPU_CLK_DIV_MODE1_ADDR (SOC_SYS_REG_BASE + (0x8 << 2))

#define SYS_CPU_CLK_DIV_MODE1_CLKDIV_CORE_POS (0)
#define SYS_CPU_CLK_DIV_MODE1_CLKDIV_CORE_MASK (0xf)

