bekencorp/bk_idk/middleware/soc/bk723L/soc/sys_reg.h
#define SYS_CPU_DEVICE_CLK_ENABLE_IRDA_CKEN_POS (6)
#define SYS_CPU_DEVICE_CLK_ENABLE_IRDA_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_EFUSE_CKEN_POS (7)
#define SYS_CPU_DEVICE_CLK_ENABLE_EFUSE_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_I2C1_CKEN_POS (8)
#define SYS_CPU_DEVICE_CLK_ENABLE_I2C1_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_SPI1_CKEN_POS (9)
#define SYS_CPU_DEVICE_CLK_ENABLE_SPI1_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_UART1_CKEN_POS (10)
#define SYS_CPU_DEVICE_CLK_ENABLE_UART1_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_UART2_CKEN_POS (11)
#define SYS_CPU_DEVICE_CLK_ENABLE_UART2_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_PWM1_CKEN_POS (12)
#define SYS_CPU_DEVICE_CLK_ENABLE_PWM1_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_TIM1_CKEN_POS (13)
#define SYS_CPU_DEVICE_CLK_ENABLE_TIM1_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_TIM2_CKEN_POS (14)
#define SYS_CPU_DEVICE_CLK_ENABLE_TIM2_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_OTP_CKEN_POS (15)
#define SYS_CPU_DEVICE_CLK_ENABLE_OTP_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_I2S_CKEN_POS (16)
#define SYS_CPU_DEVICE_CLK_ENABLE_I2S_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_USB_CKEN_POS (17)
#define SYS_CPU_DEVICE_CLK_ENABLE_USB_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_CAN_CKEN_POS (18)
#define SYS_CPU_DEVICE_CLK_ENABLE_CAN_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_PSRAM_CKEN_POS (19)
#define SYS_CPU_DEVICE_CLK_ENABLE_PSRAM_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_QSPI0_CKEN_POS (20)
#define SYS_CPU_DEVICE_CLK_ENABLE_QSPI0_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_QSPI1_CKEN_POS (21)
#define SYS_CPU_DEVICE_CLK_ENABLE_QSPI1_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_SDIO_CKEN_POS (22)
#define SYS_CPU_DEVICE_CLK_ENABLE_SDIO_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_AUXS_CKEN_POS (23)
#define SYS_CPU_DEVICE_CLK_ENABLE_AUXS_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_BTDM_CKEN_POS (24)
#define SYS_CPU_DEVICE_CLK_ENABLE_BTDM_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_XVR_CKEN_POS (25)
#define SYS_CPU_DEVICE_CLK_ENABLE_XVR_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_MAC_CKEN_POS (26)
#define SYS_CPU_DEVICE_CLK_ENABLE_MAC_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_PHY_CKEN_POS (27)
#define SYS_CPU_DEVICE_CLK_ENABLE_PHY_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_JPEG_CKEN_POS (28)
#define SYS_CPU_DEVICE_CLK_ENABLE_JPEG_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_DISP_CKEN_POS (29)
#define SYS_CPU_DEVICE_CLK_ENABLE_DISP_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_AUD_CKEN_POS (30)
#define SYS_CPU_DEVICE_CLK_ENABLE_AUD_CKEN_MASK (0x1)

#define SYS_CPU_DEVICE_CLK_ENABLE_WDT_CKEN_POS (31)
#define SYS_CPU_DEVICE_CLK_ENABLE_WDT_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_ADDR (SOC_SYS_REG_BASE + (0xd << 2))

#define SYS_RESERVER_REG0XD_H264_CKEN_POS (0)
#define SYS_RESERVER_REG0XD_H264_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_I2S1_CKEN_POS (1)
#define SYS_RESERVER_REG0XD_I2S1_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_I2S2_CKEN_POS (2)
#define SYS_RESERVER_REG0XD_I2S2_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_YUV_CKEN_POS (3)
#define SYS_RESERVER_REG0XD_YUV_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_SLCD_CKEN_POS (4)
#define SYS_RESERVER_REG0XD_SLCD_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_LIN_CKEN_POS (5)
#define SYS_RESERVER_REG0XD_LIN_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_SCR_CKEN_POS (6)
#define SYS_RESERVER_REG0XD_SCR_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_ENET_CKEN_POS (7)
#define SYS_RESERVER_REG0XD_ENET_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_JPEG_CKEN_POS (8)
#define SYS_RESERVER_REG0XD_JPEG_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_CIS_AUXS_CKEN_POS (9)
#define SYS_RESERVER_REG0XD_CIS_AUXS_CKEN_MASK (0x1)

#define SYS_RESERVER_REG0XD_RESERVED_10_31_POS (10)
#define SYS_RESERVER_REG0XD_RESERVED_10_31_MASK (0x3fffff)

#define SYS_CPU_DEVICE_MEM_CTRL1_ADDR (SOC_SYS_REG_BASE + (0xe << 2))

#define SYS_CPU_DEVICE_MEM_CTRL1_UART1_SD_POS (0)
#define SYS_CPU_DEVICE_MEM_CTRL1_UART1_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_UART2_SD_POS (1)
#define SYS_CPU_DEVICE_MEM_CTRL1_UART2_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_SPI1_SD_POS (2)
#define SYS_CPU_DEVICE_MEM_CTRL1_SPI1_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_SDIO_SD_POS (3)
#define SYS_CPU_DEVICE_MEM_CTRL1_SDIO_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_USB_SD_POS (4)
#define SYS_CPU_DEVICE_MEM_CTRL1_USB_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_CAN_SD_POS (5)
#define SYS_CPU_DEVICE_MEM_CTRL1_CAN_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_QSPI0_SD_POS (6)
#define SYS_CPU_DEVICE_MEM_CTRL1_QSPI0_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_QSPI1_SD_POS (7)
#define SYS_CPU_DEVICE_MEM_CTRL1_QSPI1_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_PRAM_SD_POS (8)
#define SYS_CPU_DEVICE_MEM_CTRL1_PRAM_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_FFT_SD_POS (9)
#define SYS_CPU_DEVICE_MEM_CTRL1_FFT_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_ABC_SD_POS (10)
#define SYS_CPU_DEVICE_MEM_CTRL1_ABC_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_AUD_SD_POS (11)
#define SYS_CPU_DEVICE_MEM_CTRL1_AUD_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_I2S0_SD_POS (12)
#define SYS_CPU_DEVICE_MEM_CTRL1_I2S0_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_I2S1_SD_POS (13)
#define SYS_CPU_DEVICE_MEM_CTRL1_I2S1_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_I2S2_SD_POS (14)
#define SYS_CPU_DEVICE_MEM_CTRL1_I2S2_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_JPGE_SD_POS (15)
#define SYS_CPU_DEVICE_MEM_CTRL1_JPGE_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_YUV_SD_POS (16)
#define SYS_CPU_DEVICE_MEM_CTRL1_YUV_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_JPGD_SD_POS (17)
#define SYS_CPU_DEVICE_MEM_CTRL1_JPGD_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_DISP_SD_POS (18)
#define SYS_CPU_DEVICE_MEM_CTRL1_DISP_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_DMAD_SD_POS (19)
#define SYS_CPU_DEVICE_MEM_CTRL1_DMAD_SD_MASK (0x1)

