bekencorp/bk_idk/middleware/soc/bk723L/soc/sys_reg.h
#define SYS_CPU_DEVICE_MEM_CTRL1_H26F_SD_POS (20)
#define SYS_CPU_DEVICE_MEM_CTRL1_H26F_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_MAC_SD_POS (21)
#define SYS_CPU_DEVICE_MEM_CTRL1_MAC_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_PHY_SD_POS (22)
#define SYS_CPU_DEVICE_MEM_CTRL1_PHY_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_XVR_SD_POS (23)
#define SYS_CPU_DEVICE_MEM_CTRL1_XVR_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_IRDA_SD_POS (24)
#define SYS_CPU_DEVICE_MEM_CTRL1_IRDA_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_LA_SD_POS (25)
#define SYS_CPU_DEVICE_MEM_CTRL1_LA_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_FLSH_SD_POS (26)
#define SYS_CPU_DEVICE_MEM_CTRL1_FLSH_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_UART_SD_POS (27)
#define SYS_CPU_DEVICE_MEM_CTRL1_UART_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_SPI0_SD_POS (28)
#define SYS_CPU_DEVICE_MEM_CTRL1_SPI0_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_ENC_SD_POS (29)
#define SYS_CPU_DEVICE_MEM_CTRL1_ENC_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_DMA0_SD_POS (30)
#define SYS_CPU_DEVICE_MEM_CTRL1_DMA0_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL1_DMA1_SD_POS (31)
#define SYS_CPU_DEVICE_MEM_CTRL1_DMA1_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_ADDR (SOC_SYS_REG_BASE + (0xf << 2))

#define SYS_CPU_DEVICE_MEM_CTRL2_UART1_DS_POS (0)
#define SYS_CPU_DEVICE_MEM_CTRL2_UART1_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_UART2_DS_POS (1)
#define SYS_CPU_DEVICE_MEM_CTRL2_UART2_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_SPI1_DS_POS (2)
#define SYS_CPU_DEVICE_MEM_CTRL2_SPI1_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_SDIO_DS_POS (3)
#define SYS_CPU_DEVICE_MEM_CTRL2_SDIO_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_USB_DS_POS (4)
#define SYS_CPU_DEVICE_MEM_CTRL2_USB_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_CAN_DS_POS (5)
#define SYS_CPU_DEVICE_MEM_CTRL2_CAN_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_QSPI0_DS_POS (6)
#define SYS_CPU_DEVICE_MEM_CTRL2_QSPI0_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_QSPI1_DS_POS (7)
#define SYS_CPU_DEVICE_MEM_CTRL2_QSPI1_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_PRAM_DS_POS (8)
#define SYS_CPU_DEVICE_MEM_CTRL2_PRAM_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_FFT_DS_POS (9)
#define SYS_CPU_DEVICE_MEM_CTRL2_FFT_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_ABC_DS_POS (10)
#define SYS_CPU_DEVICE_MEM_CTRL2_ABC_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_AUD_DS_POS (11)
#define SYS_CPU_DEVICE_MEM_CTRL2_AUD_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_I2S0_DS_POS (12)
#define SYS_CPU_DEVICE_MEM_CTRL2_I2S0_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_I2S1_DS_POS (13)
#define SYS_CPU_DEVICE_MEM_CTRL2_I2S1_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_I2S2_DS_POS (14)
#define SYS_CPU_DEVICE_MEM_CTRL2_I2S2_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_JPGE_DS_POS (15)
#define SYS_CPU_DEVICE_MEM_CTRL2_JPGE_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_YUV_DS_POS (16)
#define SYS_CPU_DEVICE_MEM_CTRL2_YUV_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_JPGD_DS_POS (17)
#define SYS_CPU_DEVICE_MEM_CTRL2_JPGD_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_DISP_DS_POS (18)
#define SYS_CPU_DEVICE_MEM_CTRL2_DISP_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_DMAD_DS_POS (19)
#define SYS_CPU_DEVICE_MEM_CTRL2_DMAD_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_H26F_DS_POS (20)
#define SYS_CPU_DEVICE_MEM_CTRL2_H26F_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_MAC_DS_POS (21)
#define SYS_CPU_DEVICE_MEM_CTRL2_MAC_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_PHY_DS_POS (22)
#define SYS_CPU_DEVICE_MEM_CTRL2_PHY_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_XVR_DS_POS (23)
#define SYS_CPU_DEVICE_MEM_CTRL2_XVR_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_IRDA_DS_POS (24)
#define SYS_CPU_DEVICE_MEM_CTRL2_IRDA_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_LA_DS_POS (25)
#define SYS_CPU_DEVICE_MEM_CTRL2_LA_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_FLSH_DS_POS (26)
#define SYS_CPU_DEVICE_MEM_CTRL2_FLSH_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_UART_DS_POS (27)
#define SYS_CPU_DEVICE_MEM_CTRL2_UART_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_SPI0_DS_POS (28)
#define SYS_CPU_DEVICE_MEM_CTRL2_SPI0_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_ENC_DS_POS (29)
#define SYS_CPU_DEVICE_MEM_CTRL2_ENC_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_DMA0_DS_POS (30)
#define SYS_CPU_DEVICE_MEM_CTRL2_DMA0_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_DMA1_DS_POS (31)
#define SYS_CPU_DEVICE_MEM_CTRL2_DMA1_DS_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_ADDR (SOC_SYS_REG_BASE + (0x10 << 2))

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM1_POS (0)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM1_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM2_POS (1)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM2_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM3_POS (2)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM3_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_ENCP_POS (3)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_ENCP_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_BAKP_POS (4)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_BAKP_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_AHBP_POS (5)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_AHBP_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_AUDP_POS (6)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_AUDP_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_VIDP_POS (7)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_VIDP_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_BTSP_POS (8)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_BTSP_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_WIFP_MAC_POS (9)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_WIFP_MAC_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_WIFP_PHY_POS (10)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_WIFP_PHY_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM0_POS (11)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM0_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM4_POS (12)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM4_MASK (0x1)

