bekencorp/bk_idk/middleware/soc/bk723L/soc/sys_reg.h
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_OFDM_POS (13)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_OFDM_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM5_POS (14)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM5_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_ROM_PGEN_POS (15)
#define SYS_CPU_POWER_SLEEP_WAKEUP_ROM_PGEN_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_NEED_FLASH_IDLE_POS (16)
#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_NEED_FLASH_IDLE_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_NEED_CPU1_WFI_POS (17)
#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_NEED_CPU1_WFI_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_NEED_CPU0_WFI_POS (18)
#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_NEED_CPU0_WFI_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_GLOBAL_POS (19)
#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_GLOBAL_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_BUS_IDLE_BYPASS_POS (20)
#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_BUS_IDLE_BYPASS_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_NEED_CPU2_WFI_POS (21)
#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_NEED_CPU2_WFI_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_BTS_SOFT_WAKEUP_REQ_POS (22)
#define SYS_CPU_POWER_SLEEP_WAKEUP_BTS_SOFT_WAKEUP_REQ_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_ROM_RD_DISABLE_POS (23)
#define SYS_CPU_POWER_SLEEP_WAKEUP_ROM_RD_DISABLE_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_OTP_RD_DISABLE_POS (24)
#define SYS_CPU_POWER_SLEEP_WAKEUP_OTP_RD_DISABLE_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_TCM0_PGEN_POS (25)
#define SYS_CPU_POWER_SLEEP_WAKEUP_TCM0_PGEN_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_CPU0_SUBPWDM_EN_POS (26)
#define SYS_CPU_POWER_SLEEP_WAKEUP_CPU0_SUBPWDM_EN_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_CPU2_TICKTIMER_32K_ENABLE_POS (27)
#define SYS_CPU_POWER_SLEEP_WAKEUP_CPU2_TICKTIMER_32K_ENABLE_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_SHARE_MEM_CLKGATING_DISABLE_POS (28)
#define SYS_CPU_POWER_SLEEP_WAKEUP_SHARE_MEM_CLKGATING_DISABLE_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_CPU0_TICKTIMER_32K_ENABLE_POS (29)
#define SYS_CPU_POWER_SLEEP_WAKEUP_CPU0_TICKTIMER_32K_ENABLE_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_CPU1_TICKTIMER_32K_ENABLE_POS (30)
#define SYS_CPU_POWER_SLEEP_WAKEUP_CPU1_TICKTIMER_32K_ENABLE_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_BUSMATRIX_BUSY_POS (31)
#define SYS_CPU_POWER_SLEEP_WAKEUP_BUSMATRIX_BUSY_MASK (0x1)

#define SYS_CPU0_LV_SLEEP_CFG_ADDR (SOC_SYS_REG_BASE + (0x11 << 2))

#define SYS_CPU0_LV_SLEEP_CFG_CPU0_CACHE_RET_EN_POS (0)
#define SYS_CPU0_LV_SLEEP_CFG_CPU0_CACHE_RET_EN_MASK (0x1)

#define SYS_CPU0_LV_SLEEP_CFG_CPU0_CACHE_SLEEPPWD_EN_POS (1)
#define SYS_CPU0_LV_SLEEP_CFG_CPU0_CACHE_SLEEPPWD_EN_MASK (0x1)

#define SYS_CPU0_LV_SLEEP_CFG_CPU0_FPU_SLEEPPWD_EN_POS (2)
#define SYS_CPU0_LV_SLEEP_CFG_CPU0_FPU_SLEEPPWD_EN_MASK (0x1)

#define SYS_CPU0_LV_SLEEP_CFG_RESERVED_3_31_POS (3)
#define SYS_CPU0_LV_SLEEP_CFG_RESERVED_3_31_MASK (0x1fffffff)

#define SYS_CPU_DEVICE_MEM_CTRL3_ADDR (SOC_SYS_REG_BASE + (0x12 << 2))

#define SYS_CPU_DEVICE_MEM_CTRL3_RAM0_MEM_DS_DEEP_SLEEP_POS (0)
#define SYS_CPU_DEVICE_MEM_CTRL3_RAM0_MEM_DS_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_RAM1_DEEP_SLEEP_POS (1)
#define SYS_CPU_DEVICE_MEM_CTRL3_RAM1_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_RAM2_DEEP_SLEEP_POS (2)
#define SYS_CPU_DEVICE_MEM_CTRL3_RAM2_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_RAM3_DEEP_SLEEP_POS (3)
#define SYS_CPU_DEVICE_MEM_CTRL3_RAM3_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_RAM4_DEEP_SLEEP_POS (4)
#define SYS_CPU_DEVICE_MEM_CTRL3_RAM4_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_CPU0_ICACHE_ITAG_DEEP_SLEEP_POS (5)
#define SYS_CPU_DEVICE_MEM_CTRL3_CPU0_ICACHE_ITAG_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_CPU0_DCACHE_DTAG_DEEP_SLEEP_POS (6)
#define SYS_CPU_DEVICE_MEM_CTRL3_CPU0_DCACHE_DTAG_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_CPU1_ICACHE_ITAG_DEEP_SLEEP_POS (7)
#define SYS_CPU_DEVICE_MEM_CTRL3_CPU1_ICACHE_ITAG_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_CPU1_DCACHE_DTAG_DEEP_SLEEP_POS (8)
#define SYS_CPU_DEVICE_MEM_CTRL3_CPU1_DCACHE_DTAG_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_CPU0_ITCM_DEEP_SLEEP_POS (9)
#define SYS_CPU_DEVICE_MEM_CTRL3_CPU0_ITCM_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_CPU0_DTCM_DEEP_SLEEP_POS (10)
#define SYS_CPU_DEVICE_MEM_CTRL3_CPU0_DTCM_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_CPU1_ITCM_DEEP_SLEEP_POS (11)
#define SYS_CPU_DEVICE_MEM_CTRL3_CPU1_ITCM_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_CPU1_DTCM_DEEP_SLEEP_POS (12)
#define SYS_CPU_DEVICE_MEM_CTRL3_CPU1_DTCM_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_ROTT_DEEP_SLEEP_POS (13)
#define SYS_CPU_DEVICE_MEM_CTRL3_ROTT_DEEP_SLEEP_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_SCAL0_DS_POS (14)
#define SYS_CPU_DEVICE_MEM_CTRL3_SCAL0_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_SCAL1_DS_POS (15)
#define SYS_CPU_DEVICE_MEM_CTRL3_SCAL1_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_RAM0_MEM_SD_SHUTDOWN_POS (16)
#define SYS_CPU_DEVICE_MEM_CTRL3_RAM0_MEM_SD_SHUTDOWN_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_RAM1_SHUTDOWN_POS (17)
#define SYS_CPU_DEVICE_MEM_CTRL3_RAM1_SHUTDOWN_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_RAM2_SHUTDOWN_POS (18)
#define SYS_CPU_DEVICE_MEM_CTRL3_RAM2_SHUTDOWN_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_RAM3_SHUTDOWN_POS (19)
#define SYS_CPU_DEVICE_MEM_CTRL3_RAM3_SHUTDOWN_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_RAM4_SHUTDOWN_POS (20)
#define SYS_CPU_DEVICE_MEM_CTRL3_RAM4_SHUTDOWN_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_CPU0_ICACHE_ITAG_SHUTDOWN_POS (21)
#define SYS_CPU_DEVICE_MEM_CTRL3_CPU0_ICACHE_ITAG_SHUTDOWN_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_CPU0_DCACHE_DTAG_SHUTDOWN_POS (22)
#define SYS_CPU_DEVICE_MEM_CTRL3_CPU0_DCACHE_DTAG_SHUTDOWN_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_CPU1_ICACHE_ITAG_SHUTDOWN_POS (23)
#define SYS_CPU_DEVICE_MEM_CTRL3_CPU1_ICACHE_ITAG_SHUTDOWN_MASK (0x1)

