bekencorp/bk_idk/middleware/soc/bk723L/soc/sys_reg.h
#define SYS_CPU_DEVICE_MEM_CTRL3_CPU1_DCACHE_DTAG_SHUTDOWN_POS (24)
#define SYS_CPU_DEVICE_MEM_CTRL3_CPU1_DCACHE_DTAG_SHUTDOWN_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_CPU0_ITCM_SHUTDOWN_POS (25)
#define SYS_CPU_DEVICE_MEM_CTRL3_CPU0_ITCM_SHUTDOWN_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_CPU0_DTCM_SHUTDOWN_POS (26)
#define SYS_CPU_DEVICE_MEM_CTRL3_CPU0_DTCM_SHUTDOWN_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_CPU1_ITCM_SHUTDOWN_POS (27)
#define SYS_CPU_DEVICE_MEM_CTRL3_CPU1_ITCM_SHUTDOWN_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_CPU1_DTCM_SHUTDOWN_POS (28)
#define SYS_CPU_DEVICE_MEM_CTRL3_CPU1_DTCM_SHUTDOWN_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_ROTT_SHUTDOWN_POS (29)
#define SYS_CPU_DEVICE_MEM_CTRL3_ROTT_SHUTDOWN_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_SCAL0_SD_POS (30)
#define SYS_CPU_DEVICE_MEM_CTRL3_SCAL0_SD_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_SCAL1_SD_POS (31)
#define SYS_CPU_DEVICE_MEM_CTRL3_SCAL1_SD_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_ADDR (SOC_SYS_REG_BASE + (0x20 << 2))

#define SYS_CPU0_INT_0_31_EN_CPU0_DMA0_NSEC_INTR_EN_POS (0)
#define SYS_CPU0_INT_0_31_EN_CPU0_DMA0_NSEC_INTR_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_ENCP_SEC_INTR_EN_POS (1)
#define SYS_CPU0_INT_0_31_EN_CPU0_ENCP_SEC_INTR_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_ENCP_NSEC_INTR_EN_POS (2)
#define SYS_CPU0_INT_0_31_EN_CPU0_ENCP_NSEC_INTR_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_TIMER0_INT_EN_POS (3)
#define SYS_CPU0_INT_0_31_EN_CPU0_TIMER0_INT_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_UART_INT_EN_POS (4)
#define SYS_CPU0_INT_0_31_EN_CPU0_UART_INT_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_PWM0_INT_EN_POS (5)
#define SYS_CPU0_INT_0_31_EN_CPU0_PWM0_INT_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_I2C0_INT_EN_POS (6)
#define SYS_CPU0_INT_0_31_EN_CPU0_I2C0_INT_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_SPI0_INT_EN_POS (7)
#define SYS_CPU0_INT_0_31_EN_CPU0_SPI0_INT_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_SADC_INT_EN_POS (8)
#define SYS_CPU0_INT_0_31_EN_CPU0_SADC_INT_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_IRDA_INT_EN_POS (9)
#define SYS_CPU0_INT_0_31_EN_CPU0_IRDA_INT_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_SDIO_INT_EN_POS (10)
#define SYS_CPU0_INT_0_31_EN_CPU0_SDIO_INT_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_GDMA_INT_EN_POS (11)
#define SYS_CPU0_INT_0_31_EN_CPU0_GDMA_INT_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_LA_INT_EN_POS (12)
#define SYS_CPU0_INT_0_31_EN_CPU0_LA_INT_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_TIMER1_INT_EN_POS (13)
#define SYS_CPU0_INT_0_31_EN_CPU0_TIMER1_INT_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_I2C1_INT_EN_POS (14)
#define SYS_CPU0_INT_0_31_EN_CPU0_I2C1_INT_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_UART1_INT_EN_POS (15)
#define SYS_CPU0_INT_0_31_EN_CPU0_UART1_INT_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_UART2_INT_EN_POS (16)
#define SYS_CPU0_INT_0_31_EN_CPU0_UART2_INT_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_SPI1_INT_EN_POS (17)
#define SYS_CPU0_INT_0_31_EN_CPU0_SPI1_INT_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_CAN_INT_EN_POS (18)
#define SYS_CPU0_INT_0_31_EN_CPU0_CAN_INT_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_USB_INT_EN_POS (19)
#define SYS_CPU0_INT_0_31_EN_CPU0_USB_INT_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_QSPI0_INT_EN_POS (20)
#define SYS_CPU0_INT_0_31_EN_CPU0_QSPI0_INT_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_CKMN_INT_EN_POS (21)
#define SYS_CPU0_INT_0_31_EN_CPU0_CKMN_INT_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_SBC_INT_EN_POS (22)
#define SYS_CPU0_INT_0_31_EN_CPU0_SBC_INT_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_AUD_INT_EN_POS (23)
#define SYS_CPU0_INT_0_31_EN_CPU0_AUD_INT_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_I2S0_INT_EN_POS (24)
#define SYS_CPU0_INT_0_31_EN_CPU0_I2S0_INT_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_JPEGENC_INT_EN_POS (25)
#define SYS_CPU0_INT_0_31_EN_CPU0_JPEGENC_INT_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_JPEGDEC_INT_EN_POS (26)
#define SYS_CPU0_INT_0_31_EN_CPU0_JPEGDEC_INT_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_LCD_DISPLAY_INT_EN_POS (27)
#define SYS_CPU0_INT_0_31_EN_CPU0_LCD_DISPLAY_INT_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_DMA2D_INT_EN_POS (28)
#define SYS_CPU0_INT_0_31_EN_CPU0_DMA2D_INT_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_WIFI_INT_PHY_MPB_EN_POS (29)
#define SYS_CPU0_INT_0_31_EN_CPU0_WIFI_INT_PHY_MPB_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_WIFI_INT_PHY_RIU_EN_POS (30)
#define SYS_CPU0_INT_0_31_EN_CPU0_WIFI_INT_PHY_RIU_EN_MASK (0x1)
	
#define SYS_CPU0_INT_0_31_EN_CPU0_WIFI_MAC_INT_TX_RX_TIMER_EN_POS (31)
#define SYS_CPU0_INT_0_31_EN_CPU0_WIFI_MAC_INT_TX_RX_TIMER_EN_MASK (0x1)


#define SYS_CPU0_INT_32_63_EN_ADDR (SOC_SYS_REG_BASE + (0x21 << 2))

#define SYS_CPU0_INT_32_63_EN_CPU0_WIFI_MAC_INT_TX_RX_MISC_EN_POS (0)
#define SYS_CPU0_INT_32_63_EN_CPU0_WIFI_MAC_INT_TX_RX_MISC_EN_MASK (0x1)
#define SYS_CPU0_INT_32_63_EN_CPU0_WIFI_HSU_IRQ_EN_POS (0)
#define SYS_CPU0_INT_32_63_EN_CPU0_WIFI_HSU_IRQ_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_WIFI_MAC_INT_RX_TRIGGER_EN_POS (1)
#define SYS_CPU0_INT_32_63_EN_CPU0_WIFI_MAC_INT_RX_TRIGGER_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_WIFI_MAC_INT_TX_TRIGGER_EN_POS (2)
#define SYS_CPU0_INT_32_63_EN_CPU0_WIFI_MAC_INT_TX_TRIGGER_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_WIFI_MAC_INT_PROT_TRIGGER_EN_POS (3)
#define SYS_CPU0_INT_32_63_EN_CPU0_WIFI_MAC_INT_PROT_TRIGGER_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_WIFI_MAC_INT_GEN_EN_POS (4)
#define SYS_CPU0_INT_32_63_EN_CPU0_WIFI_MAC_INT_GEN_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_GPIO_NS_EN_POS (5)
#define SYS_CPU0_INT_32_63_EN_CPU0_GPIO_NS_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_WIFI_INT_MAC_WAKEUP_EN_POS (6)
#define SYS_CPU0_INT_32_63_EN_CPU0_WIFI_INT_MAC_WAKEUP_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_DM_IRQ_EN_POS (7)
#define SYS_CPU0_INT_32_63_EN_CPU0_DM_IRQ_EN_MASK (0x1)

