bekencorp/bk_idk/middleware/soc/bk723L/soc/sys_reg.h
#define SYS_CPU0_INT_32_63_EN_CPU0_BLE_IRQ_EN_POS (8)
#define SYS_CPU0_INT_32_63_EN_CPU0_BLE_IRQ_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_BT_IRQ_EN_POS (9)
#define SYS_CPU0_INT_32_63_EN_CPU0_BT_IRQ_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_QSPI1_INT_EN_POS (10)
#define SYS_CPU0_INT_32_63_EN_CPU0_QSPI1_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_PWM1_INT_EN_POS (11)
#define SYS_CPU0_INT_32_63_EN_CPU0_PWM1_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_I2S1_INT_EN_POS (12)
#define SYS_CPU0_INT_32_63_EN_CPU0_I2S1_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_I2S2_INT_EN_POS (13)
#define SYS_CPU0_INT_32_63_EN_CPU0_I2S2_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_H264_INT_EN_POS (14)
#define SYS_CPU0_INT_32_63_EN_CPU0_H264_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_SDMADC_INT_EN_POS (15)
#define SYS_CPU0_INT_32_63_EN_CPU0_SDMADC_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_ETHERNET_INT_EN_POS (16)
#define SYS_CPU0_INT_32_63_EN_CPU0_ETHERNET_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_SCAL0_INT_EN_POS (17)
#define SYS_CPU0_INT_32_63_EN_CPU0_SCAL0_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_OTP_INT_EN_POS (18)
#define SYS_CPU0_INT_32_63_EN_CPU0_OTP_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_DPLL_UNLOCK_INT_EN_POS (19)
#define SYS_CPU0_INT_32_63_EN_CPU0_DPLL_UNLOCK_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_TOUCHED_INT_EN_POS (20)
#define SYS_CPU0_INT_32_63_EN_CPU0_TOUCHED_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_USBPLUG_INT_EN_POS (21)
#define SYS_CPU0_INT_32_63_EN_CPU0_USBPLUG_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_RTC_INT_EN_POS (22)
#define SYS_CPU0_INT_32_63_EN_CPU0_RTC_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_GPIO_INT_EN_POS (23)
#define SYS_CPU0_INT_32_63_EN_CPU0_GPIO_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_DMA1_SEC_INT_EN_POS (24)
#define SYS_CPU0_INT_32_63_EN_CPU0_DMA1_SEC_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_DMA1_NSEC_INT_EN_POS (25)
#define SYS_CPU0_INT_32_63_EN_CPU0_DMA1_NSEC_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_YUVB_INT_EN_POS (26)
#define SYS_CPU0_INT_32_63_EN_CPU0_YUVB_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_ROTT_INT_EN_POS (27)
#define SYS_CPU0_INT_32_63_EN_CPU0_ROTT_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_7816_INT_EN_POS (28)
#define SYS_CPU0_INT_32_63_EN_7816_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_LIN_INT_EN_POS (29)
#define SYS_CPU0_INT_32_63_EN_LIN_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_SCAL1_INT_EN_POS (30)
#define SYS_CPU0_INT_32_63_EN_SCAL1_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_MAILBOX_INT_EN_POS (31)
#define SYS_CPU0_INT_32_63_EN_MAILBOX_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_LIN_INT_EN_POS (29)
#define SYS_CPU0_INT_32_63_EN_CPU0_LIN_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_ADDR (SOC_SYS_REG_BASE + (0x22 << 2))

#define SYS_CPU1_INT_0_31_EN_CPU1_DMA0_NSEC_INTR_EN_POS (0)
#define SYS_CPU1_INT_0_31_EN_CPU1_DMA0_NSEC_INTR_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_ENCP_SEC_INTR_EN_POS (1)
#define SYS_CPU1_INT_0_31_EN_CPU1_ENCP_SEC_INTR_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_ENCP_NSEC_INTR_EN_POS (2)
#define SYS_CPU1_INT_0_31_EN_CPU1_ENCP_NSEC_INTR_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_TIMER0_INT_EN_POS (3)
#define SYS_CPU1_INT_0_31_EN_CPU1_TIMER0_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_UART_INT_EN_POS (4)
#define SYS_CPU1_INT_0_31_EN_CPU1_UART_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_PWM0_INT_EN_POS (5)
#define SYS_CPU1_INT_0_31_EN_CPU1_PWM0_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_I2C0_INT_EN_POS (6)
#define SYS_CPU1_INT_0_31_EN_CPU1_I2C0_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_SPI0_INT_EN_POS (7)
#define SYS_CPU1_INT_0_31_EN_CPU1_SPI0_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_SADC_INT_EN_POS (8)
#define SYS_CPU1_INT_0_31_EN_CPU1_SADC_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_IRDA_INT_EN_POS (9)
#define SYS_CPU1_INT_0_31_EN_CPU1_IRDA_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_SDIO_INT_EN_POS (10)
#define SYS_CPU1_INT_0_31_EN_CPU1_SDIO_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_GDMA_INT_EN_POS (11)
#define SYS_CPU1_INT_0_31_EN_CPU1_GDMA_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_LA_INT_EN_POS (12)
#define SYS_CPU1_INT_0_31_EN_CPU1_LA_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_TIMER1_INT_EN_POS (13)
#define SYS_CPU1_INT_0_31_EN_CPU1_TIMER1_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_I2C1_INT_EN_POS (14)
#define SYS_CPU1_INT_0_31_EN_CPU1_I2C1_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_UART1_INT_EN_POS (15)
#define SYS_CPU1_INT_0_31_EN_CPU1_UART1_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_UART2_INT_EN_POS (16)
#define SYS_CPU1_INT_0_31_EN_CPU1_UART2_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_SPI1_INT_EN_POS (17)
#define SYS_CPU1_INT_0_31_EN_CPU1_SPI1_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_CAN_INT_EN_POS (18)
#define SYS_CPU1_INT_0_31_EN_CPU1_CAN_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_USB_INT_EN_POS (19)
#define SYS_CPU1_INT_0_31_EN_CPU1_USB_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_QSPI0_INT_EN_POS (20)
#define SYS_CPU1_INT_0_31_EN_CPU1_QSPI0_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_CKMN_INT_EN_POS (21)
#define SYS_CPU1_INT_0_31_EN_CPU1_CKMN_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_SBC_INT_EN_POS (22)
#define SYS_CPU1_INT_0_31_EN_CPU1_SBC_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_AUD_INT_EN_POS (23)
#define SYS_CPU1_INT_0_31_EN_CPU1_AUD_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_I2S0_INT_EN_POS (24)
#define SYS_CPU1_INT_0_31_EN_CPU1_I2S0_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_JPEGENC_INT_EN_POS (25)
#define SYS_CPU1_INT_0_31_EN_CPU1_JPEGENC_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_JPEGDEC_INT_EN_POS (26)
#define SYS_CPU1_INT_0_31_EN_CPU1_JPEGDEC_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_LCD_DISPLAY_INT_EN_POS (27)
#define SYS_CPU1_INT_0_31_EN_CPU1_LCD_DISPLAY_INT_EN_MASK (0x1)

