bekencorp/bk_idk/middleware/soc/bk723L/soc/sys_reg.h
#define SYS_CPU1_INT_0_31_EN_CPU1_DMA2D_INT_EN_POS (28)
#define SYS_CPU1_INT_0_31_EN_CPU1_DMA2D_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_WIFI_INT_PHY_MPB_EN_POS (29)
#define SYS_CPU1_INT_0_31_EN_CPU1_WIFI_INT_PHY_MPB_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_WIFI_INT_PHY_RIU_EN_POS (30)
#define SYS_CPU1_INT_0_31_EN_CPU1_WIFI_INT_PHY_RIU_EN_MASK (0x1)

#define SYS_CPU1_INT_0_31_EN_CPU1_WIFI_MAC_INT_TX_RX_TIMER_EN_POS (31)
#define SYS_CPU1_INT_0_31_EN_CPU1_WIFI_MAC_INT_TX_RX_TIMER_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_ADDR (SOC_SYS_REG_BASE + (0x23 << 2))

#define SYS_CPU1_INT_32_63_EN_CPU1_WIFI_MAC_INT_TX_RX_MISC_EN_POS (0)
#define SYS_CPU1_INT_32_63_EN_CPU1_WIFI_MAC_INT_TX_RX_MISC_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_WIFI_MAC_INT_RX_TRIGGER_EN_POS (1)
#define SYS_CPU1_INT_32_63_EN_CPU1_WIFI_MAC_INT_RX_TRIGGER_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_WIFI_MAC_INT_TX_TRIGGER_EN_POS (2)
#define SYS_CPU1_INT_32_63_EN_CPU1_WIFI_MAC_INT_TX_TRIGGER_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_WIFI_MAC_INT_PROT_TRIGGER_EN_POS (3)
#define SYS_CPU1_INT_32_63_EN_CPU1_WIFI_MAC_INT_PROT_TRIGGER_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_WIFI_MAC_INT_GEN_EN_POS (4)
#define SYS_CPU1_INT_32_63_EN_CPU1_WIFI_MAC_INT_GEN_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_WIFI_HSU_IRQ_EN_POS (5)
#define SYS_CPU1_INT_32_63_EN_CPU1_WIFI_HSU_IRQ_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_WIFI_INT_MAC_WAKEUP_EN_POS (6)
#define SYS_CPU1_INT_32_63_EN_CPU1_WIFI_INT_MAC_WAKEUP_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_DM_IRQ_EN_POS (7)
#define SYS_CPU1_INT_32_63_EN_CPU1_DM_IRQ_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_BLE_IRQ_EN_POS (8)
#define SYS_CPU1_INT_32_63_EN_CPU1_BLE_IRQ_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_BT_IRQ_EN_POS (9)
#define SYS_CPU1_INT_32_63_EN_CPU1_BT_IRQ_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_QSPI1_INT_EN_POS (10)
#define SYS_CPU1_INT_32_63_EN_CPU1_QSPI1_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_PWM1_INT_EN_POS (11)
#define SYS_CPU1_INT_32_63_EN_CPU1_PWM1_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_I2S1_INT_EN_POS (12)
#define SYS_CPU1_INT_32_63_EN_CPU1_I2S1_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_I2S2_INT_EN_POS (13)
#define SYS_CPU1_INT_32_63_EN_CPU1_I2S2_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_H264_INT_EN_POS (14)
#define SYS_CPU1_INT_32_63_EN_CPU1_H264_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_SDMADC_INT_EN_POS (15)
#define SYS_CPU1_INT_32_63_EN_CPU1_SDMADC_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_MBOX0_INT_EN_POS (16)
#define SYS_CPU1_INT_32_63_EN_CPU1_MBOX0_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_MBOX1_INT_EN_POS (17)
#define SYS_CPU1_INT_32_63_EN_CPU1_MBOX1_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_BMC64_INT_EN_POS (18)
#define SYS_CPU1_INT_32_63_EN_CPU1_BMC64_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_DPLL_UNLOCK_INT_EN_POS (19)
#define SYS_CPU1_INT_32_63_EN_CPU1_DPLL_UNLOCK_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_TOUCHED_INT_EN_POS (20)
#define SYS_CPU1_INT_32_63_EN_CPU1_TOUCHED_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_USBPLUG_INT_EN_POS (21)
#define SYS_CPU1_INT_32_63_EN_CPU1_USBPLUG_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_RTC_INT_EN_POS (22)
#define SYS_CPU1_INT_32_63_EN_CPU1_RTC_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_GPIO_INT_EN_POS (23)
#define SYS_CPU1_INT_32_63_EN_CPU1_GPIO_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_DMA1_SEC_INT_EN_POS (24)
#define SYS_CPU1_INT_32_63_EN_CPU1_DMA1_SEC_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_DMA1_NSEC_INT_EN_POS (25)
#define SYS_CPU1_INT_32_63_EN_CPU1_DMA1_NSEC_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_YUVB_INT_EN_POS (26)
#define SYS_CPU1_INT_32_63_EN_CPU1_YUVB_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_CPU1_ROTT_INT_EN_POS (27)
#define SYS_CPU1_INT_32_63_EN_CPU1_ROTT_INT_EN_MASK (0x1)

#define SYS_CPU1_INT_32_63_EN_RESERVED0_POS (28)
#define SYS_CPU1_INT_32_63_EN_RESERVED0_MASK (0xf)


#define SYS_CPU2_INT_0_31_EN_ADDR (SOC_SYS_REG_BASE + (0x24 << 2))

#define SYS_CPU2_INT_0_31_EN_CPU2_DMA0_NSEC_INTR_EN_POS (0)
#define SYS_CPU2_INT_0_31_EN_CPU2_DMA0_NSEC_INTR_EN_MASK (0x1)

#define SYS_CPU2_INT_0_31_EN_CPU2_ENCP_SEC_INTR_EN_POS (1)
#define SYS_CPU2_INT_0_31_EN_CPU2_ENCP_SEC_INTR_EN_MASK (0x1)

#define SYS_CPU2_INT_0_31_EN_CPU2_ENCP_NSEC_INTR_EN_POS (2)
#define SYS_CPU2_INT_0_31_EN_CPU2_ENCP_NSEC_INTR_EN_MASK (0x1)

#define SYS_CPU2_INT_0_31_EN_CPU2_TIMER0_INT_EN_POS (3)
#define SYS_CPU2_INT_0_31_EN_CPU2_TIMER0_INT_EN_MASK (0x1)

#define SYS_CPU2_INT_0_31_EN_CPU2_UART_INT_EN_POS (4)
#define SYS_CPU2_INT_0_31_EN_CPU2_UART_INT_EN_MASK (0x1)

#define SYS_CPU2_INT_0_31_EN_CPU2_PWM0_INT_EN_POS (5)
#define SYS_CPU2_INT_0_31_EN_CPU2_PWM0_INT_EN_MASK (0x1)

#define SYS_CPU2_INT_0_31_EN_CPU2_I2C0_INT_EN_POS (6)
#define SYS_CPU2_INT_0_31_EN_CPU2_I2C0_INT_EN_MASK (0x1)

#define SYS_CPU2_INT_0_31_EN_CPU2_SPI0_INT_EN_POS (7)
#define SYS_CPU2_INT_0_31_EN_CPU2_SPI0_INT_EN_MASK (0x1)

#define SYS_CPU2_INT_0_31_EN_CPU2_SADC_INT_EN_POS (8)
#define SYS_CPU2_INT_0_31_EN_CPU2_SADC_INT_EN_MASK (0x1)

#define SYS_CPU2_INT_0_31_EN_CPU2_IRDA_INT_EN_POS (9)
#define SYS_CPU2_INT_0_31_EN_CPU2_IRDA_INT_EN_MASK (0x1)

#define SYS_CPU2_INT_0_31_EN_CPU2_SDIO_INT_EN_POS (10)
#define SYS_CPU2_INT_0_31_EN_CPU2_SDIO_INT_EN_MASK (0x1)

#define SYS_CPU2_INT_0_31_EN_CPU2_GDMA_INT_EN_POS (11)
#define SYS_CPU2_INT_0_31_EN_CPU2_GDMA_INT_EN_MASK (0x1)

#define SYS_CPU2_INT_0_31_EN_CPU2_LA_INT_EN_POS (12)
#define SYS_CPU2_INT_0_31_EN_CPU2_LA_INT_EN_MASK (0x1)

#define SYS_CPU2_INT_0_31_EN_CPU2_TIMER1_INT_EN_POS (13)
#define SYS_CPU2_INT_0_31_EN_CPU2_TIMER1_INT_EN_MASK (0x1)

#define SYS_CPU2_INT_0_31_EN_CPU2_I2C1_INT_EN_POS (14)
#define SYS_CPU2_INT_0_31_EN_CPU2_I2C1_INT_EN_MASK (0x1)

#define SYS_CPU2_INT_0_31_EN_CPU2_UART1_INT_EN_POS (15)
#define SYS_CPU2_INT_0_31_EN_CPU2_UART1_INT_EN_MASK (0x1)

#define SYS_CPU2_INT_0_31_EN_CPU2_UART2_INT_EN_POS (16)
#define SYS_CPU2_INT_0_31_EN_CPU2_UART2_INT_EN_MASK (0x1)

#define SYS_CPU2_INT_0_31_EN_CPU2_SPI1_INT_EN_POS (17)
#define SYS_CPU2_INT_0_31_EN_CPU2_SPI1_INT_EN_MASK (0x1)

#define SYS_CPU2_INT_0_31_EN_CPU2_CAN_INT_EN_POS (18)
#define SYS_CPU2_INT_0_31_EN_CPU2_CAN_INT_EN_MASK (0x1)

