bekencorp/bk_idk/middleware/soc/bk723L/soc/sys_reg.h
#define SYS_CPU0_INT_0_31_STATUS_CPU0_IRDA_INT_ST_POS (9)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_IRDA_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_SDIO_INT_ST_POS (10)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_SDIO_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_GDMA_INT_ST_POS (11)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_GDMA_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_LA_INT_ST_POS (12)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_LA_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_TIMER1_INT_ST_POS (13)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_TIMER1_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_I2C1_INT_ST_POS (14)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_I2C1_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_UART1_INT_ST_POS (15)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_UART1_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_UART2_INT_ST_POS (16)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_UART2_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_SPI1_INT_ST_POS (17)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_SPI1_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_CAN_INT_ST_POS (18)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_CAN_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_USB_INT_ST_POS (19)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_USB_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_QSPI0_INT_ST_POS (20)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_QSPI0_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_CKMN_INT_ST_POS (21)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_CKMN_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_SBC_INT_ST_POS (22)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_SBC_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_AUD_INT_ST_POS (23)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_AUD_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_I2S0_INT_ST_POS (24)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_I2S0_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_JPEGENC_INT_ST_POS (25)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_JPEGENC_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_JPEGDEC_INT_ST_POS (26)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_JPEGDEC_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_LCD_DISPLAY_INT_ST_POS (27)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_LCD_DISPLAY_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_DMA2D_INT_ST_POS (28)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_DMA2D_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_WIFI_INT_PHY_MPB_ST_POS (29)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_WIFI_INT_PHY_MPB_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_WIFI_INT_PHY_RIU_ST_POS (30)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_WIFI_INT_PHY_RIU_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_WIFI_MAC_INT_TX_RX_TIMER_ST_POS (31)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_WIFI_MAC_INT_TX_RX_TIMER_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_ADDR (SOC_SYS_REG_BASE + (0x29 << 2))

#define SYS_CPU0_INT_32_63_STATUS_CPU0_WIFI_MAC_INT_TX_RX_MISC_ST_POS (0)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_WIFI_MAC_INT_TX_RX_MISC_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_WIFI_MAC_INT_RX_TRIGGER_ST_POS (1)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_WIFI_MAC_INT_RX_TRIGGER_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_WIFI_MAC_INT_TX_TRIGGER_ST_POS (2)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_WIFI_MAC_INT_TX_TRIGGER_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_WIFI_MAC_INT_PROT_TRIGGER_ST_POS (3)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_WIFI_MAC_INT_PROT_TRIGGER_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_WIFI_MAC_INT_GEN_ST_POS (4)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_WIFI_MAC_INT_GEN_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_WIFI_HSU_IRQ_ST_POS (5)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_WIFI_HSU_IRQ_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_WIFI_INT_MAC_WAKEUP_ST_POS (6)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_WIFI_INT_MAC_WAKEUP_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_DM_IRQ_ST_POS (7)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_DM_IRQ_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_BLE_IRQ_ST_POS (8)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_BLE_IRQ_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_BT_IRQ_ST_POS (9)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_BT_IRQ_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_QSPI1_INT_ST_POS (10)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_QSPI1_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_PWM1_INT_ST_POS (11)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_PWM1_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_I2S1_INT_ST_POS (12)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_I2S1_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_I2S2_INT_ST_POS (13)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_I2S2_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_H264_INT_ST_POS (14)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_H264_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_SDMADC_INT_ST_POS (15)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_SDMADC_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_MBOX0_INT_ST_POS (16)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_MBOX0_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_MBOX1_INT_ST_POS (17)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_MBOX1_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_BMC64_INT_ST_POS (18)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_BMC64_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_DPLL_UNLOCK_INT_ST_POS (19)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_DPLL_UNLOCK_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_TOUCHED_INT_ST_POS (20)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_TOUCHED_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_USBPLUG_INT_ST_POS (21)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_USBPLUG_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_RTC_INT_ST_POS (22)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_RTC_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_GPIO_INT_ST_POS (23)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_GPIO_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_DMA1_SEC_INT_ST_POS (24)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_DMA1_SEC_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_DMA1_NSEC_INT_ST_POS (25)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_DMA1_NSEC_INT_ST_MASK (0x1)

