bekencorp/bk_idk/middleware/soc/bk723L/soc/sys_reg.h
#define SYS_CPU0_INT_32_63_STATUS_CPU0_YUVB_INT_ST_POS (26)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_YUVB_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_ROTT_INT_ST_POS (27)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_ROTT_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_RESERVED0_POS (28)
#define SYS_CPU0_INT_32_63_STATUS_RESERVED0_MASK (0xf)

#define SYS_CPU1_INT_0_31_STATUS_ADDR (SOC_SYS_REG_BASE + (0x2a << 2))

#define SYS_CPU1_INT_0_31_STATUS_CPU1_DMA0_NSEC_INTR_ST_POS (0)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_DMA0_NSEC_INTR_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_ENCP_SEC_INTR_ST_POS (1)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_ENCP_SEC_INTR_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_ENCP_NSEC_INTR_ST_POS (2)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_ENCP_NSEC_INTR_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_TIMER0_INT_ST_POS (3)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_TIMER0_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_UART_INT_ST_POS (4)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_UART_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_PWM0_INT_ST_POS (5)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_PWM0_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_I2C0_INT_ST_POS (6)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_I2C0_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_SPI0_INT_ST_POS (7)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_SPI0_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_SADC_INT_ST_POS (8)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_SADC_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_IRDA_INT_ST_POS (9)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_IRDA_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_SDIO_INT_ST_POS (10)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_SDIO_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_GDMA_INT_ST_POS (11)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_GDMA_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_LA_INT_ST_POS (12)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_LA_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_TIMER1_INT_ST_POS (13)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_TIMER1_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_I2C1_INT_ST_POS (14)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_I2C1_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_UART1_INT_ST_POS (15)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_UART1_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_UART2_INT_ST_POS (16)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_UART2_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_SPI1_INT_ST_POS (17)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_SPI1_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_CAN_INT_ST_POS (18)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_CAN_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_USB_INT_ST_POS (19)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_USB_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_QSPI0_INT_ST_POS (20)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_QSPI0_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_CKMN_INT_ST_POS (21)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_CKMN_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_SBC_INT_ST_POS (22)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_SBC_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_AUD_INT_ST_POS (23)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_AUD_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_I2S0_INT_ST_POS (24)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_I2S0_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_JPEGENC_INT_ST_POS (25)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_JPEGENC_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_JPEGDEC_INT_ST_POS (26)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_JPEGDEC_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_LCD_DISPLAY_INT_ST_POS (27)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_LCD_DISPLAY_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_DMA2D_INT_ST_POS (28)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_DMA2D_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_WIFI_INT_PHY_MPB_ST_POS (29)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_WIFI_INT_PHY_MPB_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_WIFI_INT_PHY_RIU_ST_POS (30)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_WIFI_INT_PHY_RIU_ST_MASK (0x1)

#define SYS_CPU1_INT_0_31_STATUS_CPU1_WIFI_MAC_INT_TX_RX_TIMER_ST_POS (31)
#define SYS_CPU1_INT_0_31_STATUS_CPU1_WIFI_MAC_INT_TX_RX_TIMER_ST_MASK (0x1)

#define SYS_CPU1_INT_32_63_STATUS_ADDR (SOC_SYS_REG_BASE + (0x2b << 2))

#define SYS_CPU1_INT_32_63_STATUS_CPU1_WIFI_MAC_INT_TX_RX_MISC_ST_POS (0)
#define SYS_CPU1_INT_32_63_STATUS_CPU1_WIFI_MAC_INT_TX_RX_MISC_ST_MASK (0x1)

#define SYS_CPU1_INT_32_63_STATUS_CPU1_WIFI_MAC_INT_RX_TRIGGER_ST_POS (1)
#define SYS_CPU1_INT_32_63_STATUS_CPU1_WIFI_MAC_INT_RX_TRIGGER_ST_MASK (0x1)

#define SYS_CPU1_INT_32_63_STATUS_CPU1_WIFI_MAC_INT_TX_TRIGGER_ST_POS (2)
#define SYS_CPU1_INT_32_63_STATUS_CPU1_WIFI_MAC_INT_TX_TRIGGER_ST_MASK (0x1)

#define SYS_CPU1_INT_32_63_STATUS_CPU1_WIFI_MAC_INT_PROT_TRIGGER_ST_POS (3)
#define SYS_CPU1_INT_32_63_STATUS_CPU1_WIFI_MAC_INT_PROT_TRIGGER_ST_MASK (0x1)

#define SYS_CPU1_INT_32_63_STATUS_CPU1_WIFI_MAC_INT_GEN_ST_POS (4)
#define SYS_CPU1_INT_32_63_STATUS_CPU1_WIFI_MAC_INT_GEN_ST_MASK (0x1)

#define SYS_CPU1_INT_32_63_STATUS_CPU1_WIFI_HSU_IRQ_ST_POS (5)
#define SYS_CPU1_INT_32_63_STATUS_CPU1_WIFI_HSU_IRQ_ST_MASK (0x1)

#define SYS_CPU1_INT_32_63_STATUS_CPU1_WIFI_INT_MAC_WAKEUP_ST_POS (6)
#define SYS_CPU1_INT_32_63_STATUS_CPU1_WIFI_INT_MAC_WAKEUP_ST_MASK (0x1)

#define SYS_CPU1_INT_32_63_STATUS_CPU1_DM_IRQ_ST_POS (7)
#define SYS_CPU1_INT_32_63_STATUS_CPU1_DM_IRQ_ST_MASK (0x1)

#define SYS_CPU1_INT_32_63_STATUS_CPU1_BLE_IRQ_ST_POS (8)
#define SYS_CPU1_INT_32_63_STATUS_CPU1_BLE_IRQ_ST_MASK (0x1)

#define SYS_CPU1_INT_32_63_STATUS_CPU1_BT_IRQ_ST_POS (9)
#define SYS_CPU1_INT_32_63_STATUS_CPU1_BT_IRQ_ST_MASK (0x1)

#define SYS_CPU1_INT_32_63_STATUS_CPU1_QSPI1_INT_ST_POS (10)
#define SYS_CPU1_INT_32_63_STATUS_CPU1_QSPI1_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_32_63_STATUS_CPU1_PWM1_INT_ST_POS (11)
#define SYS_CPU1_INT_32_63_STATUS_CPU1_PWM1_INT_ST_MASK (0x1)

#define SYS_CPU1_INT_32_63_STATUS_CPU1_I2S1_INT_ST_POS (12)
#define SYS_CPU1_INT_32_63_STATUS_CPU1_I2S1_INT_ST_MASK (0x1)

