bekencorp/bk_idk/middleware/soc/bk723L/soc/sys_reg.h
#define SYS_CPU2_INT_32_63_STATUS_ADDR (SOC_SYS_REG_BASE + (0x2d << 2))

#define SYS_CPU2_INT_32_63_STATUS_CPU2_WIFI_MAC_INT_TX_RX_MISC_ST_POS (0)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_WIFI_MAC_INT_TX_RX_MISC_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_WIFI_MAC_INT_RX_TRIGGER_ST_POS (1)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_WIFI_MAC_INT_RX_TRIGGER_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_WIFI_MAC_INT_TX_TRIGGER_ST_POS (2)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_WIFI_MAC_INT_TX_TRIGGER_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_WIFI_MAC_INT_PROT_TRIGGER_ST_POS (3)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_WIFI_MAC_INT_PROT_TRIGGER_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_WIFI_MAC_INT_GEN_ST_POS (4)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_WIFI_MAC_INT_GEN_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_WIFI_HSU_IRQ_ST_POS (5)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_WIFI_HSU_IRQ_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_WIFI_INT_MAC_WAKEUP_ST_POS (6)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_WIFI_INT_MAC_WAKEUP_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_DM_IRQ_ST_POS (7)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_DM_IRQ_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_BLE_IRQ_ST_POS (8)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_BLE_IRQ_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_BT_IRQ_ST_POS (9)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_BT_IRQ_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_QSPI1_INT_ST_POS (10)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_QSPI1_INT_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_PWM1_INT_ST_POS (11)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_PWM1_INT_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_I2S1_INT_ST_POS (12)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_I2S1_INT_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_I2S2_INT_ST_POS (13)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_I2S2_INT_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_H264_INT_ST_POS (14)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_H264_INT_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_SDMADC_INT_ST_POS (15)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_SDMADC_INT_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_MBOX0_INT_ST_POS (16)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_MBOX0_INT_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_MBOX1_INT_ST_POS (17)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_MBOX1_INT_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_BMC64_INT_ST_POS (18)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_BMC64_INT_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_DPLL_UNLOCK_INT_ST_POS (19)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_DPLL_UNLOCK_INT_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_TOUCHED_INT_ST_POS (20)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_TOUCHED_INT_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_USBPLUG_INT_ST_POS (21)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_USBPLUG_INT_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_RTC_INT_ST_POS (22)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_RTC_INT_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_GPIO_INT_ST_POS (23)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_GPIO_INT_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_DMA1_SEC_INT_ST_POS (24)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_DMA1_SEC_INT_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_DMA1_NSEC_INT_ST_POS (25)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_DMA1_NSEC_INT_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_YUVB_INT_ST_POS (26)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_YUVB_INT_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_CPU2_ROTT_INT_ST_POS (27)
#define SYS_CPU2_INT_32_63_STATUS_CPU2_ROTT_INT_ST_MASK (0x1)

#define SYS_CPU2_INT_32_63_STATUS_RESERVED0_POS (28)
#define SYS_CPU2_INT_32_63_STATUS_RESERVED0_MASK (0xf)

#define SYS_GPIO_CONFIG0_ADDR (SOC_SYS_REG_BASE + (0x30 << 2))

#define SYS_GPIO_CONFIG0_GPIO_CONFIG0_POS (0)
#define SYS_GPIO_CONFIG0_GPIO_CONFIG0_MASK (0xffffffff)

#define SYS_GPIO_CONFIG1_ADDR (SOC_SYS_REG_BASE + (0x31 << 2))

#define SYS_GPIO_CONFIG1_GPIO_CONFIG1_POS (0)
#define SYS_GPIO_CONFIG1_GPIO_CONFIG1_MASK (0xffffffff)

#define SYS_GPIO_CONFIG2_ADDR (SOC_SYS_REG_BASE + (0x32 << 2))

#define SYS_GPIO_CONFIG2_GPIO_CONFIG2_POS (0)
#define SYS_GPIO_CONFIG2_GPIO_CONFIG2_MASK (0xffffffff)

#define SYS_GPIO_CONFIG3_ADDR (SOC_SYS_REG_BASE + (0x33 << 2))

#define SYS_GPIO_CONFIG3_GPIO_CONFIG3_POS (0)
#define SYS_GPIO_CONFIG3_GPIO_CONFIG3_MASK (0xffffffff)

#define SYS_GPIO_CONFIG4_ADDR (SOC_SYS_REG_BASE + (0x34 << 2))

#define SYS_GPIO_CONFIG4_GPIO_CONFIG4_POS (0)
#define SYS_GPIO_CONFIG4_GPIO_CONFIG4_MASK (0xffffffff)

#define SYS_GPIO_CONFIG5_ADDR (SOC_SYS_REG_BASE + (0x35 << 2))

#define SYS_GPIO_CONFIG5_GPIO_CONFIG5_POS (0)
#define SYS_GPIO_CONFIG5_GPIO_CONFIG5_MASK (0xffffffff)

#define SYS_GPIO_CONFIG6_ADDR (SOC_SYS_REG_BASE + (0x36 << 2))

#define SYS_GPIO_CONFIG6_GPIO_CONFIG6_POS (0)
#define SYS_GPIO_CONFIG6_GPIO_CONFIG6_MASK (0xffffffff)

#define SYS_SYS_DEBUG_CONFIG0_ADDR (SOC_SYS_REG_BASE + (0x38 << 2))

#define SYS_SYS_DEBUG_CONFIG0_DBUG_CONFIG0_POS (0)
#define SYS_SYS_DEBUG_CONFIG0_DBUG_CONFIG0_MASK (0xffffffff)

#define SYS_SYS_DEBUG_CONFIG1_ADDR (SOC_SYS_REG_BASE + (0x39 << 2))

#define SYS_SYS_DEBUG_CONFIG1_DBUG_CONFIG1_POS (0)
#define SYS_SYS_DEBUG_CONFIG1_DBUG_CONFIG1_MASK (0xffffffff)

#define SYS_ANA_REG0_ADDR (SOC_SYS_REG_BASE + (0x40 << 2))

#define SYS_ANA_REG0_DPLL_TSTEN_POS (0)
#define SYS_ANA_REG0_DPLL_TSTEN_MASK (0x1)

#define SYS_ANA_REG0_CP_POS (1)
#define SYS_ANA_REG0_CP_MASK (0x7)

#define SYS_ANA_REG0_SPIDETEN_POS (4)
#define SYS_ANA_REG0_SPIDETEN_MASK (0x1)

#define SYS_ANA_REG0_HVREF_POS (5)
#define SYS_ANA_REG0_HVREF_MASK (0x3)

#define SYS_ANA_REG0_LVREF_POS (7)
#define SYS_ANA_REG0_LVREF_MASK (0x3)

#define SYS_ANA_REG0_RZCTRL26M_POS (9)
#define SYS_ANA_REG0_RZCTRL26M_MASK (0x1)

#define SYS_ANA_REG0_LOOPRZCTRL_POS (10)
#define SYS_ANA_REG0_LOOPRZCTRL_MASK (0xf)

#define SYS_ANA_REG0_RPC_POS (14)
#define SYS_ANA_REG0_RPC_MASK (0x3)

#define SYS_ANA_REG0_OPENLOOP_EN_POS (16)
#define SYS_ANA_REG0_OPENLOOP_EN_MASK (0x1)

