bekencorp/bk_idk/middleware/soc/bk723L/soc/sys_reg.h
#define SYS_ANA_REG0_CKSEL_POS (17)
#define SYS_ANA_REG0_CKSEL_MASK (0x3)

#define SYS_ANA_REG0_SPITRIG_POS (19)
#define SYS_ANA_REG0_SPITRIG_MASK (0x1)

#define SYS_ANA_REG0_BAND0_POS (20)
#define SYS_ANA_REG0_BAND0_MASK (0x1)

#define SYS_ANA_REG0_BAND1_POS (21)
#define SYS_ANA_REG0_BAND1_MASK (0x1)

#define SYS_ANA_REG0_BAND_POS (22)
#define SYS_ANA_REG0_BAND_MASK (0x7)

#define SYS_ANA_REG0_BANDMANUAL_POS (25)
#define SYS_ANA_REG0_BANDMANUAL_MASK (0x1)

#define SYS_ANA_REG0_DSPTRIG_POS (26)
#define SYS_ANA_REG0_DSPTRIG_MASK (0x1)

#define SYS_ANA_REG0_LPEN_DPLL_POS (27)
#define SYS_ANA_REG0_LPEN_DPLL_MASK (0x1)

#define SYS_ANA_REG0_NC_28_30_POS (28)
#define SYS_ANA_REG0_NC_28_30_MASK (0x7)

#define SYS_ANA_REG0_VCTRL_DPLLLDO_POS (31)
#define SYS_ANA_REG0_VCTRL_DPLLLDO_MASK (0x1)

#define SYS_ANA_REG1_ADDR (SOC_SYS_REG_BASE + (0x41 << 2))

#define SYS_ANA_REG1_NC3_POS (0)
#define SYS_ANA_REG1_NC3_MASK (0x1)

#define SYS_ANA_REG1_NC2_POS (1)
#define SYS_ANA_REG1_NC2_MASK (0x1)

#define SYS_ANA_REG1_MSW_POS (2)
#define SYS_ANA_REG1_MSW_MASK (0x1ff)

#define SYS_ANA_REG1_ICTRL_POS (11)
#define SYS_ANA_REG1_ICTRL_MASK (0x7)

#define SYS_ANA_REG1_OSC_TRIG_POS (14)
#define SYS_ANA_REG1_OSC_TRIG_MASK (0x1)

#define SYS_ANA_REG1_OSCCAL_TRIG_POS (15)
#define SYS_ANA_REG1_OSCCAL_TRIG_MASK (0x1)

#define SYS_ANA_REG1_CNTI_POS (16)
#define SYS_ANA_REG1_CNTI_MASK (0x1ff)

#define SYS_ANA_REG1_SPI_RST_POS (25)
#define SYS_ANA_REG1_SPI_RST_MASK (0x1)

#define SYS_ANA_REG1_AMSEL_POS (26)
#define SYS_ANA_REG1_AMSEL_MASK (0x1)

#define SYS_ANA_REG1_DIVCTRL_POS (27)
#define SYS_ANA_REG1_DIVCTRL_MASK (0x7)

#define SYS_ANA_REG1_NC1_POS (30)
#define SYS_ANA_REG1_NC1_MASK (0x1)

#define SYS_ANA_REG1_NC0_POS (31)
#define SYS_ANA_REG1_NC0_MASK (0x1)

#define SYS_ANA_REG2_ADDR (SOC_SYS_REG_BASE + (0x42 << 2))

#define SYS_ANA_REG2_XTALH_CTUNE_POS (0)
#define SYS_ANA_REG2_XTALH_CTUNE_MASK (0xff)

#define SYS_ANA_REG2_FORCE_26MPLL_POS (8)
#define SYS_ANA_REG2_FORCE_26MPLL_MASK (0x1)

#define SYS_ANA_REG2_GADC_CMP_ICTRL_POS (9)
#define SYS_ANA_REG2_GADC_CMP_ICTRL_MASK (0x3)

#define SYS_ANA_REG2_GADC_INBUF_ICTRL_POS (11)
#define SYS_ANA_REG2_GADC_INBUF_ICTRL_MASK (0x3)

#define SYS_ANA_REG2_GADC_REFBUF_ICTRL_POS (13)
#define SYS_ANA_REG2_GADC_REFBUF_ICTRL_MASK (0x3)

#define SYS_ANA_REG2_GADC_NOBUF_ENABLE_POS (15)
#define SYS_ANA_REG2_GADC_NOBUF_ENABLE_MASK (0x1)

#define SYS_ANA_REG2_VREF_SCALE_POS (16)
#define SYS_ANA_REG2_VREF_SCALE_MASK (0x1)

#define SYS_ANA_REG2_SCAL_EN_POS (17)
#define SYS_ANA_REG2_SCAL_EN_MASK (0x1)

#define SYS_ANA_REG2_GADC_CAPCAL_EN_POS (18)
#define SYS_ANA_REG2_GADC_CAPCAL_EN_MASK (0x1)

#define SYS_ANA_REG2_GADC_CAPCAL_POS (19)
#define SYS_ANA_REG2_GADC_CAPCAL_MASK (0x3f)

#define SYS_ANA_REG2_SP_NT_CTRL_POS (25)
#define SYS_ANA_REG2_SP_NT_CTRL_MASK (0x7f)

#define SYS_ANA_REG3_ADDR (SOC_SYS_REG_BASE + (0x43 << 2))

#define SYS_ANA_REG3_LBW0V9_POS (0)
#define SYS_ANA_REG3_LBW0V9_MASK (0x1)

#define SYS_ANA_REG3_SDCLK_SEL_POS (1)
#define SYS_ANA_REG3_SDCLK_SEL_MASK (0x1)

#define SYS_ANA_REG3_SARRLCK_RLTEN_POS (2)
#define SYS_ANA_REG3_SARRLCK_RLTEN_MASK (0x1)

#define SYS_ANA_REG3_SARRLCK_INV_POS (3)
#define SYS_ANA_REG3_SARRLCK_INV_MASK (0x1)

#define SYS_ANA_REG3_BUFDRVTRM0V9_POS (4)
#define SYS_ANA_REG3_BUFDRVTRM0V9_MASK (0x1)

#define SYS_ANA_REG3_NC_5_5_POS (5)
#define SYS_ANA_REG3_NC_5_5_MASK (0x1)

#define SYS_ANA_REG3_INBUFEN0V9_POS (6)
#define SYS_ANA_REG3_INBUFEN0V9_MASK (0x1)

#define SYS_ANA_REG3_HRES_SEL0V9_POS (7)
#define SYS_ANA_REG3_HRES_SEL0V9_MASK (0x1)

#define SYS_ANA_REG3_HPSSREN_POS (8)
#define SYS_ANA_REG3_HPSSREN_MASK (0x1)

#define SYS_ANA_REG3_CK_SEL_POS (9)
#define SYS_ANA_REG3_CK_SEL_MASK (0x1)

#define SYS_ANA_REG3_ANABUF_SEL_RX_POS (10)
#define SYS_ANA_REG3_ANABUF_SEL_RX_MASK (0x1)

#define SYS_ANA_REG3_PWD_XTALLDO_POS (11)
#define SYS_ANA_REG3_PWD_XTALLDO_MASK (0x1)

#define SYS_ANA_REG3_IAMP_POS (12)
#define SYS_ANA_REG3_IAMP_MASK (0x1)

#define SYS_ANA_REG3_VDDREN_POS (13)
#define SYS_ANA_REG3_VDDREN_MASK (0x1)

#define SYS_ANA_REG3_XAMP_POS (14)
#define SYS_ANA_REG3_XAMP_MASK (0x3f)

#define SYS_ANA_REG3_VOSEL_POS (20)
#define SYS_ANA_REG3_VOSEL_MASK (0x1f)

#define SYS_ANA_REG3_EN_XTALH_SLEEP_POS (25)
#define SYS_ANA_REG3_EN_XTALH_SLEEP_MASK (0x1)

#define SYS_ANA_REG3_XTAL40_EN_POS (26)
#define SYS_ANA_REG3_XTAL40_EN_MASK (0x1)

#define SYS_ANA_REG3_BUFICTRL_POS (27)
#define SYS_ANA_REG3_BUFICTRL_MASK (0x1)

#define SYS_ANA_REG3_IBIAS_CTRL_POS (28)
#define SYS_ANA_REG3_IBIAS_CTRL_MASK (0x3)

#define SYS_ANA_REG3_ICORE_CTRL_POS (30)
#define SYS_ANA_REG3_ICORE_CTRL_MASK (0x3)

#define SYS_ANA_REG4_ADDR (SOC_SYS_REG_BASE + (0x44 << 2))

#define SYS_ANA_REG4_ANABUF_SEL_TX_POS (0)
#define SYS_ANA_REG4_ANABUF_SEL_TX_MASK (0x1)

#define SYS_ANA_REG4_TRNG_TSTEN_POS (1)
#define SYS_ANA_REG4_TRNG_TSTEN_MASK (0x1)

#define SYS_ANA_REG4_ITUNE_REF_POS (2)
#define SYS_ANA_REG4_ITUNE_REF_MASK (0x7)

#define SYS_ANA_REG4_ITUNE_OPA_POS (5)
#define SYS_ANA_REG4_ITUNE_OPA_MASK (0x7)

#define SYS_ANA_REG4_ITUNE_CMP_POS (8)
#define SYS_ANA_REG4_ITUNE_CMP_MASK (0x7)

#define SYS_ANA_REG4_RNOOISE_SEL_POS (11)
#define SYS_ANA_REG4_RNOOISE_SEL_MASK (0x1)

#define SYS_ANA_REG4_FSLOW_SEL_POS (12)
#define SYS_ANA_REG4_FSLOW_SEL_MASK (0x7)

#define SYS_ANA_REG4_FFAST_SEL_POS (15)
#define SYS_ANA_REG4_FFAST_SEL_MASK (0xf)

#define SYS_ANA_REG4_TRNG_TSTCK_SEL_POS (19)
#define SYS_ANA_REG4_TRNG_TSTCK_SEL_MASK (0x1)

#define SYS_ANA_REG4_CKTST_SEL_POS (20)
#define SYS_ANA_REG4_CKTST_SEL_MASK (0x3)

#define SYS_ANA_REG4_CK_TST_ENBALE_POS (22)
#define SYS_ANA_REG4_CK_TST_ENBALE_MASK (0x1)

#define SYS_ANA_REG4_SW_BIAS_POS (23)
#define SYS_ANA_REG4_SW_BIAS_MASK (0x1)

#define SYS_ANA_REG4_CRB_POS (24)
#define SYS_ANA_REG4_CRB_MASK (0xf)

#define SYS_ANA_REG4_PORT_ENABLEL_POS (28)
#define SYS_ANA_REG4_PORT_ENABLEL_MASK (0xf)

#define SYS_ANA_REG5_ADDR (SOC_SYS_REG_BASE + (0x45 << 2))

#define SYS_ANA_REG5_NC_0_0_POS (0)
#define SYS_ANA_REG5_NC_0_0_MASK (0x1)

#define SYS_ANA_REG5_EN_XTALL_POS (1)
#define SYS_ANA_REG5_EN_XTALL_MASK (0x1)

#define SYS_ANA_REG5_EN_DCO_POS (2)
#define SYS_ANA_REG5_EN_DCO_MASK (0x1)

#define SYS_ANA_REG5_NC_3_3_POS (3)
#define SYS_ANA_REG5_NC_3_3_MASK (0x1)

#define SYS_ANA_REG5_EN_TEMP_POS (4)
#define SYS_ANA_REG5_EN_TEMP_MASK (0x1)

#define SYS_ANA_REG5_EN_DPLL_POS (5)
#define SYS_ANA_REG5_EN_DPLL_MASK (0x1)

#define SYS_ANA_REG5_EN_CB_POS (6)
#define SYS_ANA_REG5_EN_CB_MASK (0x1)

#define SYS_ANA_REG5_EN_LCD_POS (7)
#define SYS_ANA_REG5_EN_LCD_MASK (0x1)

#define SYS_ANA_REG5_NC_8_9_POS (8)
#define SYS_ANA_REG5_NC_8_9_MASK (0x3)

#define SYS_ANA_REG5_ADC_DIV_POS (10)
#define SYS_ANA_REG5_ADC_DIV_MASK (0x3)

#define SYS_ANA_REG5_ROSC_DISABLE_POS (12)
#define SYS_ANA_REG5_ROSC_DISABLE_MASK (0x1)

