bekencorp/bk_idk/middleware/soc/bk723L/soc/sys_reg.h
#define SYS_ANA_REG5_PWDAUDPLL_POS (13)
#define SYS_ANA_REG5_PWDAUDPLL_MASK (0x1)

#define SYS_ANA_REG5_PWD_ROSC_SPI_POS (14)
#define SYS_ANA_REG5_PWD_ROSC_SPI_MASK (0x1)

#define SYS_ANA_REG5_NC_15_15_POS (15)
#define SYS_ANA_REG5_NC_15_15_MASK (0x1)

#define SYS_ANA_REG5_ITUNE_XTALL_POS (16)
#define SYS_ANA_REG5_ITUNE_XTALL_MASK (0xf)

#define SYS_ANA_REG5_XTALL_TEN_POS (20)
#define SYS_ANA_REG5_XTALL_TEN_MASK (0x1)

#define SYS_ANA_REG5_ROSC_TSTEN_POS (21)
#define SYS_ANA_REG5_ROSC_TSTEN_MASK (0x1)

#define SYS_ANA_REG5_BCAL_START_POS (22)
#define SYS_ANA_REG5_BCAL_START_MASK (0x1)

#define SYS_ANA_REG5_BCAL_EN_POS (23)
#define SYS_ANA_REG5_BCAL_EN_MASK (0x1)

#define SYS_ANA_REG5_BCAL_SEL_POS (24)
#define SYS_ANA_REG5_BCAL_SEL_MASK (0x7)

#define SYS_ANA_REG5_VBIAS_POS (27)
#define SYS_ANA_REG5_VBIAS_MASK (0x1f)

#define SYS_ANA_REG6_ADDR (SOC_SYS_REG_BASE + (0x46 << 2))

#define SYS_ANA_REG6_CALIB_INTERVAL_POS (0)
#define SYS_ANA_REG6_CALIB_INTERVAL_MASK (0x3ff)

#define SYS_ANA_REG6_MODIFY_INTERVAL_POS (10)
#define SYS_ANA_REG6_MODIFY_INTERVAL_MASK (0x3f)

#define SYS_ANA_REG6_XTAL_WAKEUP_TIME_POS (16)
#define SYS_ANA_REG6_XTAL_WAKEUP_TIME_MASK (0xf)

#define SYS_ANA_REG6_SPI_TRIG_POS (20)
#define SYS_ANA_REG6_SPI_TRIG_MASK (0x1)

#define SYS_ANA_REG6_MODIFI_AUTO_POS (21)
#define SYS_ANA_REG6_MODIFI_AUTO_MASK (0x1)

#define SYS_ANA_REG6_CALIB_AUTO_POS (22)
#define SYS_ANA_REG6_CALIB_AUTO_MASK (0x1)

#define SYS_ANA_REG6_CAL_MODE_POS (23)
#define SYS_ANA_REG6_CAL_MODE_MASK (0x1)

#define SYS_ANA_REG6_MANU_ENA_POS (24)
#define SYS_ANA_REG6_MANU_ENA_MASK (0x1)

#define SYS_ANA_REG6_MANU_CIN_POS (25)
#define SYS_ANA_REG6_MANU_CIN_MASK (0x7f)

#define SYS_ANA_REG7_ADDR (SOC_SYS_REG_BASE + (0x47 << 2))

#define SYS_ANA_REG7_PORT_ENABLEL_POS (0)
#define SYS_ANA_REG7_PORT_ENABLEL_MASK (0xffffffff)

#define SYS_ANA_REG8_ADDR (SOC_SYS_REG_BASE + (0x48 << 2))

#define SYS_ANA_REG8_IOLDO_LP_POS (0)
#define SYS_ANA_REG8_IOLDO_LP_MASK (0x1)

#define SYS_ANA_REG8_CORELDO_HP_POS (1)
#define SYS_ANA_REG8_CORELDO_HP_MASK (0x1)

#define SYS_ANA_REG8_DLDOHP_POS (2)
#define SYS_ANA_REG8_DLDOHP_MASK (0x1)

#define SYS_ANA_REG8_T_VANALDOSEL_POS (3)
#define SYS_ANA_REG8_T_VANALDOSEL_MASK (0x7)

#define SYS_ANA_REG8_R_VANALDOSEL_POS (6)
#define SYS_ANA_REG8_R_VANALDOSEL_MASK (0x7)

#define SYS_ANA_REG8_EN_TRSW_POS (9)
#define SYS_ANA_REG8_EN_TRSW_MASK (0x1)

#define SYS_ANA_REG8_ALDOHP_POS (10)
#define SYS_ANA_REG8_ALDOHP_MASK (0x1)

#define SYS_ANA_REG8_ANACURLIM_POS (11)
#define SYS_ANA_REG8_ANACURLIM_MASK (0x1)

#define SYS_ANA_REG8_VIOLDOSEL_POS (12)
#define SYS_ANA_REG8_VIOLDOSEL_MASK (0x7)

#define SYS_ANA_REG8_IOCURLIM_POS (15)
#define SYS_ANA_REG8_IOCURLIM_MASK (0x1)

#define SYS_ANA_REG8_VALOLDOSEL_POS (16)
#define SYS_ANA_REG8_VALOLDOSEL_MASK (0x7)

#define SYS_ANA_REG8_ALOPOWSEL_POS (19)
#define SYS_ANA_REG8_ALOPOWSEL_MASK (0x1)

#define SYS_ANA_REG8_EN_FAST_ALOLDO_POS (20)
#define SYS_ANA_REG8_EN_FAST_ALOLDO_MASK (0x1)

#define SYS_ANA_REG8_ALOLDOHP_POS (21)
#define SYS_ANA_REG8_ALOLDOHP_MASK (0x1)

#define SYS_ANA_REG8_BGCAL_POS (22)
#define SYS_ANA_REG8_BGCAL_MASK (0x3f)

#define SYS_ANA_REG8_VBGCALMODE_POS (28)
#define SYS_ANA_REG8_VBGCALMODE_MASK (0x1)

#define SYS_ANA_REG8_VBGCALSTART_POS (29)
#define SYS_ANA_REG8_VBGCALSTART_MASK (0x1)

#define SYS_ANA_REG8_PWD_BGCAL_POS (30)
#define SYS_ANA_REG8_PWD_BGCAL_MASK (0x1)

#define SYS_ANA_REG8_SPI_ENVBG_POS (31)
#define SYS_ANA_REG8_SPI_ENVBG_MASK (0x1)

#define SYS_ANA_REG9_ADDR (SOC_SYS_REG_BASE + (0x49 << 2))

#define SYS_ANA_REG9_WKGPIOSEL1_POS (0)
#define SYS_ANA_REG9_WKGPIOSEL1_MASK (0xf)

#define SYS_ANA_REG9_RST_WKS1V_POS (4)
#define SYS_ANA_REG9_RST_WKS1V_MASK (0x1)

#define SYS_ANA_REG9_WKGPIOSEL2_POS (5)
#define SYS_ANA_REG9_WKGPIOSEL2_MASK (0xf)

#define SYS_ANA_REG9_SPI_LATCH1V_POS (9)
#define SYS_ANA_REG9_SPI_LATCH1V_MASK (0x1)

#define SYS_ANA_REG9_DIGCURLIM_POS (10)
#define SYS_ANA_REG9_DIGCURLIM_MASK (0x1)

#define SYS_ANA_REG9_PUPRES_ENB1V_POS (11)
#define SYS_ANA_REG9_PUPRES_ENB1V_MASK (0x1)

#define SYS_ANA_REG9_PDNRES_EN1V_POS (12)
#define SYS_ANA_REG9_PDNRES_EN1V_MASK (0x1)

#define SYS_ANA_REG9_D_VEASEL1V_POS (13)
#define SYS_ANA_REG9_D_VEASEL1V_MASK (0x3)

#define SYS_ANA_REG9_ENSFSDD_POS (15)
#define SYS_ANA_REG9_ENSFSDD_MASK (0x1)

#define SYS_ANA_REG9_VCOREHSEL_POS (16)
#define SYS_ANA_REG9_VCOREHSEL_MASK (0xf)

#define SYS_ANA_REG9_VCORELSEL_POS (20)
#define SYS_ANA_REG9_VCORELSEL_MASK (0x7)

#define SYS_ANA_REG9_VLDEN_POS (23)
#define SYS_ANA_REG9_VLDEN_MASK (0x1)

#define SYS_ANA_REG9_EN_FAST_CORELDO_POS (24)
#define SYS_ANA_REG9_EN_FAST_CORELDO_MASK (0x1)

#define SYS_ANA_REG9_PWDCORELDO_POS (25)
#define SYS_ANA_REG9_PWDCORELDO_MASK (0x1)

#define SYS_ANA_REG9_VDIGHSEL_POS (26)
#define SYS_ANA_REG9_VDIGHSEL_MASK (0x7)

#define SYS_ANA_REG9_VDIGSEL_POS (29)
#define SYS_ANA_REG9_VDIGSEL_MASK (0x3)

#define SYS_ANA_REG9_VDD12LDEN_POS (31)
#define SYS_ANA_REG9_VDD12LDEN_MASK (0x1)

#define SYS_ANA_REG10_ADDR (SOC_SYS_REG_BASE + (0x4a << 2))

#define SYS_ANA_REG10_NC_0_2_POS (0)
#define SYS_ANA_REG10_NC_0_2_MASK (0x7)

#define SYS_ANA_REG10_VBSPBUFLP1V_POS (3)
#define SYS_ANA_REG10_VBSPBUFLP1V_MASK (0x1)

#define SYS_ANA_REG10_AZCDCNT_MANU_POS (4)
#define SYS_ANA_REG10_AZCDCNT_MANU_MASK (0x7)

#define SYS_ANA_REG10_TIMER_SEL_POS (7)
#define SYS_ANA_REG10_TIMER_SEL_MASK (0xf)

#define SYS_ANA_REG10_VDDGPIO_SEL_POS (11)
#define SYS_ANA_REG10_VDDGPIO_SEL_MASK (0x1)

#define SYS_ANA_REG10_EN_USBVCC1V8_POS (12)
#define SYS_ANA_REG10_EN_USBVCC1V8_MASK (0x1)

#define SYS_ANA_REG10_EN_USBVCC3V_POS (13)
#define SYS_ANA_REG10_EN_USBVCC3V_MASK (0x1)

#define SYS_ANA_REG10_NC_14_14_POS (14)
#define SYS_ANA_REG10_NC_14_14_MASK (0x1)

#define SYS_ANA_REG10_SPI_TIMERWKEN_POS (15)
#define SYS_ANA_REG10_SPI_TIMERWKEN_MASK (0x1)

#define SYS_ANA_REG10_SPI_BYP32PWD_POS (16)
#define SYS_ANA_REG10_SPI_BYP32PWD_MASK (0x1)

#define SYS_ANA_REG10_SD_POS (17)
#define SYS_ANA_REG10_SD_MASK (0x1)

#define SYS_ANA_REG10_NC_18_18_POS (18)
#define SYS_ANA_REG10_NC_18_18_MASK (0x1)

#define SYS_ANA_REG10_IOBYAPSSEN_POS (19)
#define SYS_ANA_REG10_IOBYAPSSEN_MASK (0x1)

#define SYS_ANA_REG10_CKFS_POS (20)
#define SYS_ANA_REG10_CKFS_MASK (0x3)

#define SYS_ANA_REG10_CKINTSEL_POS (22)
#define SYS_ANA_REG10_CKINTSEL_MASK (0x1)

#define SYS_ANA_REG10_OSCCALTRIG_POS (23)
#define SYS_ANA_REG10_OSCCALTRIG_MASK (0x1)

#define SYS_ANA_REG10_MROSCSEL_POS (24)
#define SYS_ANA_REG10_MROSCSEL_MASK (0x1)

