bekencorp/bk_idk/middleware/soc/bk723L/soc/sys_reg.h
#define SYS_ANA_REG10_MROSCI_CAL_POS (25)
#define SYS_ANA_REG10_MROSCI_CAL_MASK (0x7)

#define SYS_ANA_REG10_MROSCCAP_CAL_POS (28)
#define SYS_ANA_REG10_MROSCCAP_CAL_MASK (0xf)

#define SYS_ANA_REG11_ADDR (SOC_SYS_REG_BASE + (0x4b << 2))

#define SYS_ANA_REG11_SFSR_POS (0)
#define SYS_ANA_REG11_SFSR_MASK (0xf)

#define SYS_ANA_REG11_ENSFSAA_POS (4)
#define SYS_ANA_REG11_ENSFSAA_MASK (0x1)

#define SYS_ANA_REG11_APFMS_POS (5)
#define SYS_ANA_REG11_APFMS_MASK (0x1f)

#define SYS_ANA_REG11_ATMPO_SEL_POS (10)
#define SYS_ANA_REG11_ATMPO_SEL_MASK (0x3)

#define SYS_ANA_REG11_AMPOEN_POS (12)
#define SYS_ANA_REG11_AMPOEN_MASK (0x1)

#define SYS_ANA_REG11_ENPOWA_POS (13)
#define SYS_ANA_REG11_ENPOWA_MASK (0x1)

#define SYS_ANA_REG11_AVEA_SEL_POS (14)
#define SYS_ANA_REG11_AVEA_SEL_MASK (0x3)

#define SYS_ANA_REG11_AFORCEPFM_POS (16)
#define SYS_ANA_REG11_AFORCEPFM_MASK (0x1)

#define SYS_ANA_REG11_ACLS_POS (17)
#define SYS_ANA_REG11_ACLS_MASK (0x7)

#define SYS_ANA_REG11_ASWRSTEN_POS (20)
#define SYS_ANA_REG11_ASWRSTEN_MASK (0x1)

#define SYS_ANA_REG11_ARIPC_POS (21)
#define SYS_ANA_REG11_ARIPC_MASK (0x7)

#define SYS_ANA_REG11_ARAMPC_POS (24)
#define SYS_ANA_REG11_ARAMPC_MASK (0xf)

#define SYS_ANA_REG11_ARAMPCEN_POS (28)
#define SYS_ANA_REG11_ARAMPCEN_MASK (0x1)

#define SYS_ANA_REG11_AENBURST_POS (29)
#define SYS_ANA_REG11_AENBURST_MASK (0x1)

#define SYS_ANA_REG11_APFMEN_POS (30)
#define SYS_ANA_REG11_APFMEN_MASK (0x1)

#define SYS_ANA_REG11_ALDOSEL_POS (31)
#define SYS_ANA_REG11_ALDOSEL_MASK (0x1)

#define SYS_ANA_REG12_ADDR (SOC_SYS_REG_BASE + (0x4c << 2))

#define SYS_ANA_REG12_BUCKD_SOFTST_POS (0)
#define SYS_ANA_REG12_BUCKD_SOFTST_MASK (0xf)

#define SYS_ANA_REG12_DZCDCNT_MANU_POS (4)
#define SYS_ANA_REG12_DZCDCNT_MANU_MASK (0x7)

#define SYS_ANA_REG12_CLK_SEL_POS (7)
#define SYS_ANA_REG12_CLK_SEL_MASK (0x1)

#define SYS_ANA_REG12_DPFMS_POS (8)
#define SYS_ANA_REG12_DPFMS_MASK (0x1f)

#define SYS_ANA_REG12_DTMPO_SEL_POS (13)
#define SYS_ANA_REG12_DTMPO_SEL_MASK (0x3)

#define SYS_ANA_REG12_DMPOEN_POS (15)
#define SYS_ANA_REG12_DMPOEN_MASK (0x1)

#define SYS_ANA_REG12_DFORCEPFM_POS (16)
#define SYS_ANA_REG12_DFORCEPFM_MASK (0x1)

#define SYS_ANA_REG12_DCLS_POS (17)
#define SYS_ANA_REG12_DCLS_MASK (0x7)

#define SYS_ANA_REG12_DSWRSTEN_POS (20)
#define SYS_ANA_REG12_DSWRSTEN_MASK (0x1)

#define SYS_ANA_REG12_DRIPC_POS (21)
#define SYS_ANA_REG12_DRIPC_MASK (0x7)

#define SYS_ANA_REG12_DRAMPC_POS (24)
#define SYS_ANA_REG12_DRAMPC_MASK (0xf)

#define SYS_ANA_REG12_DRAMPCEN_POS (28)
#define SYS_ANA_REG12_DRAMPCEN_MASK (0x1)

#define SYS_ANA_REG12_DENBURST_POS (29)
#define SYS_ANA_REG12_DENBURST_MASK (0x1)

#define SYS_ANA_REG12_DPFMEN_POS (30)
#define SYS_ANA_REG12_DPFMEN_MASK (0x1)

#define SYS_ANA_REG12_DLDOSEL_POS (31)
#define SYS_ANA_REG12_DLDOSEL_MASK (0x1)

#define SYS_ANA_REG13_ADDR (SOC_SYS_REG_BASE + (0x4d << 2))

#define SYS_ANA_REG13_PWDOVP1V_POS (0)
#define SYS_ANA_REG13_PWDOVP1V_MASK (0x1)

#define SYS_ANA_REG13_ASOFT_STC_POS (1)
#define SYS_ANA_REG13_ASOFT_STC_MASK (0xf)

#define SYS_ANA_REG13_DLDO_CZSEL_POS (5)
#define SYS_ANA_REG13_DLDO_CZSEL_MASK (0x7)

#define SYS_ANA_REG13_DLDO_RZSEL_POS (8)
#define SYS_ANA_REG13_DLDO_RZSEL_MASK (0x3)

#define SYS_ANA_REG13_NC_10_11_POS (10)
#define SYS_ANA_REG13_NC_10_11_MASK (0x3)

#define SYS_ANA_REG13_VTRXSPISEL_POS (12)
#define SYS_ANA_REG13_VTRXSPISEL_MASK (0x3)

#define SYS_ANA_REG13_NC_14_19_POS (14)
#define SYS_ANA_REG13_NC_14_19_MASK (0x3f)

#define SYS_ANA_REG13_ALDO_CZSEL_POS (20)
#define SYS_ANA_REG13_ALDO_CZSEL_MASK (0x7)

#define SYS_ANA_REG13_ALDO_RZSEL_POS (23)
#define SYS_ANA_REG13_ALDO_RZSEL_MASK (0x3)

#define SYS_ANA_REG13_NC_25_27_POS (25)
#define SYS_ANA_REG13_NC_25_27_MASK (0x7)

#define SYS_ANA_REG13_PSLDO_SWB_POS (28)
#define SYS_ANA_REG13_PSLDO_SWB_MASK (0x1)

#define SYS_ANA_REG13_VPSRAMSEL_POS (29)
#define SYS_ANA_REG13_VPSRAMSEL_MASK (0x3)

#define SYS_ANA_REG13_ENPSRAM_POS (31)
#define SYS_ANA_REG13_ENPSRAM_MASK (0x1)

#define SYS_ANA_REG14_ADDR (SOC_SYS_REG_BASE + (0x4e << 2))

#define SYS_ANA_REG14_REG_POS (0)
#define SYS_ANA_REG14_REG_MASK (0x3ff)

#define SYS_ANA_REG14_EN_ADCMODE_POS (10)
#define SYS_ANA_REG14_EN_ADCMODE_MASK (0x1)

#define SYS_ANA_REG14_EN_OUT_TEST1V_POS (11)
#define SYS_ANA_REG14_EN_OUT_TEST1V_MASK (0x1)

#define SYS_ANA_REG14_NA_POS (12)
#define SYS_ANA_REG14_NA_MASK (0x1)

#define SYS_ANA_REG14_SEL_SERI_CAP_POS (13)
#define SYS_ANA_REG14_SEL_SERI_CAP_MASK (0x1)

#define SYS_ANA_REG14_EN_SERI_CAP_POS (14)
#define SYS_ANA_REG14_EN_SERI_CAP_MASK (0x1)

#define SYS_ANA_REG14_CAL_CTRL_POS (15)
#define SYS_ANA_REG14_CAL_CTRL_MASK (0x3)

#define SYS_ANA_REG14_CAL_VTH_POS (17)
#define SYS_ANA_REG14_CAL_VTH_MASK (0x7)

#define SYS_ANA_REG14_CRG_POS (20)
#define SYS_ANA_REG14_CRG_MASK (0x3)

#define SYS_ANA_REG14_VREFS_POS (22)
#define SYS_ANA_REG14_VREFS_MASK (0xf)

#define SYS_ANA_REG14_GAIN_S_POS (26)
#define SYS_ANA_REG14_GAIN_S_MASK (0xf)

#define SYS_ANA_REG14_TD_LATCH1V_POS (30)
#define SYS_ANA_REG14_TD_LATCH1V_MASK (0x1)

#define SYS_ANA_REG14_PWD_TD_POS (31)
#define SYS_ANA_REG14_PWD_TD_MASK (0x1)

#define SYS_ANA_REG15_ADDR (SOC_SYS_REG_BASE + (0x4f << 2))

#define SYS_ANA_REG15_TEST_NUMBER1V_POS (0)
#define SYS_ANA_REG15_TEST_NUMBER1V_MASK (0xf)

#define SYS_ANA_REG15_TEST_PERIOD1V_POS (4)
#define SYS_ANA_REG15_TEST_PERIOD1V_MASK (0xf)

#define SYS_ANA_REG15_CHS_POS (8)
#define SYS_ANA_REG15_CHS_MASK (0xffff)

#define SYS_ANA_REG15_CHS_SEL_CAL1V_POS (24)
#define SYS_ANA_REG15_CHS_SEL_CAL1V_MASK (0xf)

#define SYS_ANA_REG15_CAL_DONE_CLR1V_POS (28)
#define SYS_ANA_REG15_CAL_DONE_CLR1V_MASK (0x1)

#define SYS_ANA_REG15_EN_CAL_FORCE1V_POS (29)
#define SYS_ANA_REG15_EN_CAL_FORCE1V_MASK (0x1)

#define SYS_ANA_REG15_EN_CAL_AUTO1V_POS (30)
#define SYS_ANA_REG15_EN_CAL_AUTO1V_MASK (0x1)

#define SYS_ANA_REG15_EN_SCAN_POS (31)
#define SYS_ANA_REG15_EN_SCAN_MASK (0x1)

#define SYS_ANA_REG16_ADDR (SOC_SYS_REG_BASE + (0x50 << 2))

#define SYS_ANA_REG16_INT_EN_POS (0)
#define SYS_ANA_REG16_INT_EN_MASK (0xffff)

#define SYS_ANA_REG16_INT_EN16_POS (16)
#define SYS_ANA_REG16_INT_EN16_MASK (0x1)

#define SYS_ANA_REG16_CAL_NUMBER1V_POS (19)
#define SYS_ANA_REG16_CAL_NUMBER1V_MASK (0xf)

