bekencorp/bk_idk/middleware/soc/bk723L/soc/sys_reg.h
#define SYS_ANA_REG16_CAL_PERIOD1V_POS (23)
#define SYS_ANA_REG16_CAL_PERIOD1V_MASK (0x1ff)

#define SYS_ANA_REG17_ADDR (SOC_SYS_REG_BASE + (0x51 << 2))

#define SYS_ANA_REG17_INT_CLR_POS (0)
#define SYS_ANA_REG17_INT_CLR_MASK (0xffff)

#define SYS_ANA_REG17_INT_CLR16_POS (16)
#define SYS_ANA_REG17_INT_CLR16_MASK (0x1)

#define SYS_ANA_REG17_CK_ADC_SEL_POS (17)
#define SYS_ANA_REG17_CK_ADC_SEL_MASK (0x1)

#define SYS_ANA_REG17_INT_CLR_SEL_POS (18)
#define SYS_ANA_REG17_INT_CLR_SEL_MASK (0x1)

#define SYS_ANA_REG17_EN_LPMOD_POS (19)
#define SYS_ANA_REG17_EN_LPMOD_MASK (0x1)

#define SYS_ANA_REG17_EN_TESTCMP1V_POS (20)
#define SYS_ANA_REG17_EN_TESTCMP1V_MASK (0x1)

#define SYS_ANA_REG17_EN_MAN_WR1V_POS (21)
#define SYS_ANA_REG17_EN_MAN_WR1V_MASK (0x1)

#define SYS_ANA_REG17_EN_MANMOD1V_POS (22)
#define SYS_ANA_REG17_EN_MANMOD1V_MASK (0x1)

#define SYS_ANA_REG17_CAP_CALSPI1V_POS (23)
#define SYS_ANA_REG17_CAP_CALSPI1V_MASK (0x1ff)

#define SYS_ANA_REG18_ADDR (SOC_SYS_REG_BASE + (0x52 << 2))

#define SYS_ANA_REG18_ISELAUD_POS (0)
#define SYS_ANA_REG18_ISELAUD_MASK (0x1)

#define SYS_ANA_REG18_AUDCK_RLCEN1V_POS (1)
#define SYS_ANA_REG18_AUDCK_RLCEN1V_MASK (0x1)

#define SYS_ANA_REG18_LCHCKINVEN1V_POS (2)
#define SYS_ANA_REG18_LCHCKINVEN1V_MASK (0x1)

#define SYS_ANA_REG18_ENAUDBIAS_POS (3)
#define SYS_ANA_REG18_ENAUDBIAS_MASK (0x1)

#define SYS_ANA_REG18_ENADCBIAS_POS (4)
#define SYS_ANA_REG18_ENADCBIAS_MASK (0x1)

#define SYS_ANA_REG18_ENMICBIAS_POS (5)
#define SYS_ANA_REG18_ENMICBIAS_MASK (0x1)

#define SYS_ANA_REG18_ADCCKINVEN1V_POS (6)
#define SYS_ANA_REG18_ADCCKINVEN1V_MASK (0x1)

#define SYS_ANA_REG18_DACFB2ST0V9_POS (7)
#define SYS_ANA_REG18_DACFB2ST0V9_MASK (0x1)

#define SYS_ANA_REG18_NC1_POS (8)
#define SYS_ANA_REG18_NC1_MASK (0x1)

#define SYS_ANA_REG18_MICBIAS_TRM_POS (9)
#define SYS_ANA_REG18_MICBIAS_TRM_MASK (0x3)

#define SYS_ANA_REG18_MICBIAS_VOC_POS (11)
#define SYS_ANA_REG18_MICBIAS_VOC_MASK (0x1f)

#define SYS_ANA_REG18_VREFSEL1V_POS (16)
#define SYS_ANA_REG18_VREFSEL1V_MASK (0x1)

#define SYS_ANA_REG18_CAPSWSPI_POS (17)
#define SYS_ANA_REG18_CAPSWSPI_MASK (0x1f)

#define SYS_ANA_REG18_ADREF_SEL_POS (22)
#define SYS_ANA_REG18_ADREF_SEL_MASK (0x3)

#define SYS_ANA_REG18_NC0_POS (24)
#define SYS_ANA_REG18_NC0_MASK (0x3)

#define SYS_ANA_REG18_RESERVED_BIT_26_30_POS (26)
#define SYS_ANA_REG18_RESERVED_BIT_26_30_MASK (0x1f)

#define SYS_ANA_REG18_LCHCK_SEL_POS (30)
#define SYS_ANA_REG18_LCHCK_SEL_MASK (0x1)

#define SYS_ANA_REG18_SPI_DACCKPSSEL_POS (31)
#define SYS_ANA_REG18_SPI_DACCKPSSEL_MASK (0x1)

#define SYS_ANA_REG19_ADDR (SOC_SYS_REG_BASE + (0x53 << 2))

#define SYS_ANA_REG19_ISEL_POS (0)
#define SYS_ANA_REG19_ISEL_MASK (0x3)

#define SYS_ANA_REG19_MICIRSEL1_POS (2)
#define SYS_ANA_REG19_MICIRSEL1_MASK (0x1)

#define SYS_ANA_REG19_MICDACIT_POS (3)
#define SYS_ANA_REG19_MICDACIT_MASK (0x3)

#define SYS_ANA_REG19_MICDACIH_POS (5)
#define SYS_ANA_REG19_MICDACIH_MASK (0xff)

#define SYS_ANA_REG19_MICSINGLEEN_POS (13)
#define SYS_ANA_REG19_MICSINGLEEN_MASK (0x1)

#define SYS_ANA_REG19_DCCOMPEN_POS (14)
#define SYS_ANA_REG19_DCCOMPEN_MASK (0x1)

#define SYS_ANA_REG19_MICGAIN_POS (15)
#define SYS_ANA_REG19_MICGAIN_MASK (0xf)

#define SYS_ANA_REG19_MICDACEN_POS (19)
#define SYS_ANA_REG19_MICDACEN_MASK (0x1)

#define SYS_ANA_REG19_STG2LSEN1V_POS (20)
#define SYS_ANA_REG19_STG2LSEN1V_MASK (0x1)

#define SYS_ANA_REG19_OPENLOOPCAL1V_POS (21)
#define SYS_ANA_REG19_OPENLOOPCAL1V_MASK (0x1)

#define SYS_ANA_REG19_CALLATCH_POS (22)
#define SYS_ANA_REG19_CALLATCH_MASK (0x1)

#define SYS_ANA_REG19_VCMSEL_POS (23)
#define SYS_ANA_REG19_VCMSEL_MASK (0x1)

#define SYS_ANA_REG19_DWAMODE_POS (24)
#define SYS_ANA_REG19_DWAMODE_MASK (0x1)

#define SYS_ANA_REG19_R2REN_POS (25)
#define SYS_ANA_REG19_R2REN_MASK (0x1)

#define SYS_ANA_REG19_NC_26_27_POS (26)
#define SYS_ANA_REG19_NC_26_27_MASK (0x3)

#define SYS_ANA_REG19_MICEN_POS (28)
#define SYS_ANA_REG19_MICEN_MASK (0x1)

#define SYS_ANA_REG19_RST_POS (29)
#define SYS_ANA_REG19_RST_MASK (0x1)

#define SYS_ANA_REG19_BPDWA1V_POS (30)
#define SYS_ANA_REG19_BPDWA1V_MASK (0x1)

#define SYS_ANA_REG19_HCEN1STG_POS (31)
#define SYS_ANA_REG19_HCEN1STG_MASK (0x1)

#define SYS_ANA_REG20_ADDR (SOC_SYS_REG_BASE + (0x54 << 2))

#define SYS_ANA_REG20_HPDAC_POS (0)
#define SYS_ANA_REG20_HPDAC_MASK (0x1)

#define SYS_ANA_REG20_CALCON_SEL_POS (1)
#define SYS_ANA_REG20_CALCON_SEL_MASK (0x1)

#define SYS_ANA_REG20_OSCDAC_POS (2)
#define SYS_ANA_REG20_OSCDAC_MASK (0x3)

#define SYS_ANA_REG20_OCENDAC_POS (4)
#define SYS_ANA_REG20_OCENDAC_MASK (0x1)

#define SYS_ANA_REG20_VCMSEL_POS (5)
#define SYS_ANA_REG20_VCMSEL_MASK (0x1)

#define SYS_ANA_REG20_ADJDACREF_POS (6)
#define SYS_ANA_REG20_ADJDACREF_MASK (0x1f)

#define SYS_ANA_REG20_DCOCHG_POS (11)
#define SYS_ANA_REG20_DCOCHG_MASK (0x3)

#define SYS_ANA_REG20_DIFFEN_POS (13)
#define SYS_ANA_REG20_DIFFEN_MASK (0x1)

#define SYS_ANA_REG20_ENDACCAL_POS (14)
#define SYS_ANA_REG20_ENDACCAL_MASK (0x1)

#define SYS_ANA_REG20_NC2_POS (15)
#define SYS_ANA_REG20_NC2_MASK (0x1)

#define SYS_ANA_REG20_LENDCOC_POS (16)
#define SYS_ANA_REG20_LENDCOC_MASK (0x1)

#define SYS_ANA_REG20_NC1_POS (17)
#define SYS_ANA_REG20_NC1_MASK (0x1)

#define SYS_ANA_REG20_LENVCMD_POS (18)
#define SYS_ANA_REG20_LENVCMD_MASK (0x1)

#define SYS_ANA_REG20_DACDRVEN_POS (19)
#define SYS_ANA_REG20_DACDRVEN_MASK (0x1)

#define SYS_ANA_REG20_NC0_POS (20)
#define SYS_ANA_REG20_NC0_MASK (0x1)

#define SYS_ANA_REG20_DACLEN_POS (21)
#define SYS_ANA_REG20_DACLEN_MASK (0x1)

#define SYS_ANA_REG20_DACG_POS (22)
#define SYS_ANA_REG20_DACG_MASK (0xf)

#define SYS_ANA_REG20_DACMUTE_POS (26)
#define SYS_ANA_REG20_DACMUTE_MASK (0x1)

#define SYS_ANA_REG20_DACDWAMODE_SEL_POS (27)
#define SYS_ANA_REG20_DACDWAMODE_SEL_MASK (0x1)

#define SYS_ANA_REG20_DACSEL_POS (28)
#define SYS_ANA_REG20_DACSEL_MASK (0xf)

#define SYS_ANA_REG21_ADDR (SOC_SYS_REG_BASE + (0x55 << 2))

#define SYS_ANA_REG21_LMDCIN_POS (0)
#define SYS_ANA_REG21_LMDCIN_MASK (0xff)

#define SYS_ANA_REG21_NC1_POS (8)
#define SYS_ANA_REG21_NC1_MASK (0xff)

#define SYS_ANA_REG21_SPIRST_OVC_POS (16)
#define SYS_ANA_REG21_SPIRST_OVC_MASK (0x1)

#define SYS_ANA_REG21_NC0_POS (17)
#define SYS_ANA_REG21_NC0_MASK (0x1)

#define SYS_ANA_REG21_ENIDACL_POS (18)
#define SYS_ANA_REG21_ENIDACL_MASK (0x1)

#define SYS_ANA_REG21_DAC3RDHC0V9_POS (19)
#define SYS_ANA_REG21_DAC3RDHC0V9_MASK (0x1)

#define SYS_ANA_REG21_HC2S_POS (20)
#define SYS_ANA_REG21_HC2S_MASK (0x1)

#define SYS_ANA_REG21_RFB_CTRL_POS (21)
#define SYS_ANA_REG21_RFB_CTRL_MASK (0x1)

#define SYS_ANA_REG21_VCMSEL_POS (22)
#define SYS_ANA_REG21_VCMSEL_MASK (0x1)

#define SYS_ANA_REG21_ENBS_POS (23)
#define SYS_ANA_REG21_ENBS_MASK (0x1)

