bekencorp/bk_idk/middleware/soc/bk723L/soc/sys_reg.h
#define SYS_ANA_REG21_CALCK_SEL0V9_POS (24)
#define SYS_ANA_REG21_CALCK_SEL0V9_MASK (0x1)

#define SYS_ANA_REG21_BPDWA0V9_POS (25)
#define SYS_ANA_REG21_BPDWA0V9_MASK (0x1)

#define SYS_ANA_REG21_LOOPRST0V9_POS (26)
#define SYS_ANA_REG21_LOOPRST0V9_MASK (0x1)

#define SYS_ANA_REG21_OCT0V9_POS (27)
#define SYS_ANA_REG21_OCT0V9_MASK (0x3)

#define SYS_ANA_REG21_SOUT0V9_POS (29)
#define SYS_ANA_REG21_SOUT0V9_MASK (0x1)

#define SYS_ANA_REG21_HC0V9_POS (30)
#define SYS_ANA_REG21_HC0V9_MASK (0x3)

#define SYS_ANA_REG22_ADDR (SOC_SYS_REG_BASE + (0x56 << 2))

#define SYS_ANA_REG22_NC_0_0_POS (0)
#define SYS_ANA_REG22_NC_0_0_MASK (0x1)

#define SYS_ANA_REG22_LVREF_POS (1)
#define SYS_ANA_REG22_LVREF_MASK (0x3)

#define SYS_ANA_REG22_HVREF_POS (3)
#define SYS_ANA_REG22_HVREF_MASK (0x3)

#define SYS_ANA_REG22_BANDM_POS (5)
#define SYS_ANA_REG22_BANDM_MASK (0x7f)

#define SYS_ANA_REG22_NC_12_23_POS (12)
#define SYS_ANA_REG22_NC_12_23_MASK (0xfff)

#define SYS_ANA_REG22_N_INT_POS (24)
#define SYS_ANA_REG22_N_INT_MASK (0x3f)

#define SYS_ANA_REG22_NC_30_30_POS (30)
#define SYS_ANA_REG22_NC_30_30_MASK (0x1)

#define SYS_ANA_REG22_ERRDET_EN_POS (31)
#define SYS_ANA_REG22_ERRDET_EN_MASK (0x1)

#define SYS_ANA_REG23_ADDR (SOC_SYS_REG_BASE + (0x57 << 2))

#define SYS_ANA_REG23_INT_MOD_POS (0)
#define SYS_ANA_REG23_INT_MOD_MASK (0x1)

#define SYS_ANA_REG23_NSYN_POS (1)
#define SYS_ANA_REG23_NSYN_MASK (0x1)

#define SYS_ANA_REG23_OPEN_ENB_POS (2)
#define SYS_ANA_REG23_OPEN_ENB_MASK (0x1)

#define SYS_ANA_REG23_RESET_POS (3)
#define SYS_ANA_REG23_RESET_MASK (0x1)

#define SYS_ANA_REG23_IOFFSET_POS (4)
#define SYS_ANA_REG23_IOFFSET_MASK (0x7)

#define SYS_ANA_REG23_LPFRZ_POS (7)
#define SYS_ANA_REG23_LPFRZ_MASK (0xf)

#define SYS_ANA_REG23_VSEL_POS (11)
#define SYS_ANA_REG23_VSEL_MASK (0x1)

#define SYS_ANA_REG23_NC_12_14_POS (12)
#define SYS_ANA_REG23_NC_12_14_MASK (0x7)

#define SYS_ANA_REG23_PWD_LOCKDET_POS (15)
#define SYS_ANA_REG23_PWD_LOCKDET_MASK (0x1)

#define SYS_ANA_REG23_NC_16_17_POS (16)
#define SYS_ANA_REG23_NC_16_17_MASK (0x3)

#define SYS_ANA_REG23_SPI_TRIGGER_POS (18)
#define SYS_ANA_REG23_SPI_TRIGGER_MASK (0x1)

#define SYS_ANA_REG23_MANUAL_POS (19)
#define SYS_ANA_REG23_MANUAL_MASK (0x1)

#define SYS_ANA_REG23_TEST_EN_POS (20)
#define SYS_ANA_REG23_TEST_EN_MASK (0x1)

#define SYS_ANA_REG23_NC_21_22_POS (21)
#define SYS_ANA_REG23_NC_21_22_MASK (0x3)

#define SYS_ANA_REG23_ICP_POS (23)
#define SYS_ANA_REG23_ICP_MASK (0x3)

#define SYS_ANA_REG23_NC_25_27_POS (25)
#define SYS_ANA_REG23_NC_25_27_MASK (0x7)

#define SYS_ANA_REG23_ERRDET_SPIEN_POS (28)
#define SYS_ANA_REG23_ERRDET_SPIEN_MASK (0x1)

#define SYS_ANA_REG23_DLYSEL_POS (29)
#define SYS_ANA_REG23_DLYSEL_MASK (0x3)

#define SYS_ANA_REG23_AUDIOEN_POS (31)
#define SYS_ANA_REG23_AUDIOEN_MASK (0x1)

#define SYS_ANA_REG24_ADDR (SOC_SYS_REG_BASE + (0x58 << 2))

#define SYS_ANA_REG24_INT_CLR_CAL_POS (0)
#define SYS_ANA_REG24_INT_CLR_CAL_MASK (0xffff)

#define SYS_ANA_REG24_INT_EN_CAL_POS (16)
#define SYS_ANA_REG24_INT_EN_CAL_MASK (0xffff)

#define SYS_ANA_REG25_ADDR (SOC_SYS_REG_BASE + (0x59 << 2))

#define SYS_ANA_REG25_INT_MOD_POS (0)
#define SYS_ANA_REG25_INT_MOD_MASK (0x1)

#define SYS_ANA_REG25_NSYN_POS (1)
#define SYS_ANA_REG25_NSYN_MASK (0x1)

#define SYS_ANA_REG25_OPEN_ENB_POS (2)
#define SYS_ANA_REG25_OPEN_ENB_MASK (0x1)

#define SYS_ANA_REG25_RESET_POS (3)
#define SYS_ANA_REG25_RESET_MASK (0x1)

#define SYS_ANA_REG25_IOFFSETL_POS (4)
#define SYS_ANA_REG25_IOFFSETL_MASK (0x7)

#define SYS_ANA_REG25_LPFRZ_POS (7)
#define SYS_ANA_REG25_LPFRZ_MASK (0xf)

#define SYS_ANA_REG25_VSEL_POS (11)
#define SYS_ANA_REG25_VSEL_MASK (0x7)

#define SYS_ANA_REG25_VSEL_CAL_POS (14)
#define SYS_ANA_REG25_VSEL_CAL_MASK (0x1)

#define SYS_ANA_REG25_PWD_LOCKDET_POS (15)
#define SYS_ANA_REG25_PWD_LOCKDET_MASK (0x1)

#define SYS_ANA_REG25_LOCKDET_BYPASS_POS (16)
#define SYS_ANA_REG25_LOCKDET_BYPASS_MASK (0x1)

#define SYS_ANA_REG25_CKREF_LOOP_SEL_POS (17)
#define SYS_ANA_REG25_CKREF_LOOP_SEL_MASK (0x1)

#define SYS_ANA_REG25_SPI_TRIGGER_POS (18)
#define SYS_ANA_REG25_SPI_TRIGGER_MASK (0x1)

#define SYS_ANA_REG25_MANUAL_POS (19)
#define SYS_ANA_REG25_MANUAL_MASK (0x1)

#define SYS_ANA_REG25_TEST_CKAUDIO_EN_POS (20)
#define SYS_ANA_REG25_TEST_CKAUDIO_EN_MASK (0x1)

#define SYS_ANA_REG25_CK2XEN_POS (21)
#define SYS_ANA_REG25_CK2XEN_MASK (0x1)

#define SYS_ANA_REG25_ICP_POS (22)
#define SYS_ANA_REG25_ICP_MASK (0x3)

#define SYS_ANA_REG25_CKTST_SEL_POS (24)
#define SYS_ANA_REG25_CKTST_SEL_MASK (0x1)

#define SYS_ANA_REG25_EDGESEL_NCK_POS (25)
#define SYS_ANA_REG25_EDGESEL_NCK_MASK (0x1)

#define SYS_ANA_REG25_NLOADDLYEN_POS (26)
#define SYS_ANA_REG25_NLOADDLYEN_MASK (0x1)

#define SYS_ANA_REG25_BYPASS_CALDONE_AUTO_POS (27)
#define SYS_ANA_REG25_BYPASS_CALDONE_AUTO_MASK (0x1)

#define SYS_ANA_REG25_CAL_RES_SPI_POS (28)
#define SYS_ANA_REG25_CAL_RES_SPI_MASK (0x7)

#define SYS_ANA_REG25_AUDIOEN_POS (31)
#define SYS_ANA_REG25_AUDIOEN_MASK (0x1)

#define SYS_ANA_REG26_ADDR (SOC_SYS_REG_BASE + (0x5a << 2))

#define SYS_ANA_REG26_N_POS (0)
#define SYS_ANA_REG26_N_MASK (0x3fffffff)

#define SYS_ANA_REG26_CALRES_SPIEN_POS (30)
#define SYS_ANA_REG26_CALRES_SPIEN_MASK (0x1)

#define SYS_ANA_REG26_CALREFEN_POS (31)
#define SYS_ANA_REG26_CALREFEN_MASK (0x1)

#define SYS_ANA_REG27_ADDR (SOC_SYS_REG_BASE + (0x5b << 2))

#define SYS_ANA_REG27_ISEL_POS (0)
#define SYS_ANA_REG27_ISEL_MASK (0x3)

#define SYS_ANA_REG27_MICIRSEL1_POS (2)
#define SYS_ANA_REG27_MICIRSEL1_MASK (0x1)

#define SYS_ANA_REG27_MICDACIT_POS (3)
#define SYS_ANA_REG27_MICDACIT_MASK (0x3)

#define SYS_ANA_REG27_MICDACIH_POS (5)
#define SYS_ANA_REG27_MICDACIH_MASK (0xff)

#define SYS_ANA_REG27_MICSINGLEEN_POS (13)
#define SYS_ANA_REG27_MICSINGLEEN_MASK (0x1)

#define SYS_ANA_REG27_DCCOMPEN_POS (14)
#define SYS_ANA_REG27_DCCOMPEN_MASK (0x1)

#define SYS_ANA_REG27_MICGAIN_POS (15)
#define SYS_ANA_REG27_MICGAIN_MASK (0xf)

#define SYS_ANA_REG27_MICDACEN_POS (19)
#define SYS_ANA_REG27_MICDACEN_MASK (0x1)

#define SYS_ANA_REG27_STG2LSEN1V_POS (20)
#define SYS_ANA_REG27_STG2LSEN1V_MASK (0x1)

#define SYS_ANA_REG27_OPENLOOPCAL1V_POS (21)
#define SYS_ANA_REG27_OPENLOOPCAL1V_MASK (0x1)

#define SYS_ANA_REG27_CALLATCH_POS (22)
#define SYS_ANA_REG27_CALLATCH_MASK (0x1)

#define SYS_ANA_REG27_VCMSEL_POS (23)
#define SYS_ANA_REG27_VCMSEL_MASK (0x1)

#define SYS_ANA_REG27_DWAMODE_POS (24)
#define SYS_ANA_REG27_DWAMODE_MASK (0x1)

#define SYS_ANA_REG27_R2REN_POS (25)
#define SYS_ANA_REG27_R2REN_MASK (0x1)

#define SYS_ANA_REG27_NC_26_27_POS (26)
#define SYS_ANA_REG27_NC_26_27_MASK (0x3)

#define SYS_ANA_REG27_MICEN_POS (28)
#define SYS_ANA_REG27_MICEN_MASK (0x1)

#define SYS_ANA_REG27_RST_POS (29)
#define SYS_ANA_REG27_RST_MASK (0x1)

#define SYS_ANA_REG27_BPDWA1V_POS (30)
#define SYS_ANA_REG27_BPDWA1V_MASK (0x1)

#define SYS_ANA_REG27_HCEN1STG_POS (31)
#define SYS_ANA_REG27_HCEN1STG_MASK (0x1)

#ifdef __cplusplus
}
#endif
